label waifu:
    if book_07_units == 1:
        "Глава [book_07_units]" "{size=-2}Вы подросток который делит дом с милой сводной сестрой Ши. Что вы хотите делать сегодня после школы?{/size}"
        if not complited_leena_already and not complited_stevens_already and not complited_shea_already:
            m "Ооо это одна из\"тех\" книг. Хорошо посмотрим..."
        call school_ended
    if book_07_units == 2:
        "Глава [book_07_units]" "{size=-2}Во время занятий мисс Стивенс говорит о чем то. Вы смотрите на её грудь, что бы не уснуть. Она слишком горяченькая для учителя.{/size}"
        call school_ended
    if book_07_units == 3:
        "Глава [book_07_units]" "{size=-2}Вы встречаете свою сводную сестру в школе. В отличие от вас, Ши довольно популярна среди одноклассников, и поэтому она отрицает ваше существование.{/size}"
        call school_ended
    if book_07_units == 4:
        "Глава [book_07_units]" "{size=-2}Вы столкнулись с девушкой в коридоре, она носит очки с толстыми линзами и очень застенчива. Она извиняется и быстро убегает, она тоже учится в этой школе?{/size}"
        call school_ended
    if book_07_units == 5:
        "Глава [book_07_units]" "{size=-2}Мисс Стивенс устроили внеклассные мероприятия сегодня. Вы решаете проявить себя, что бы получить хорошую репутацию.{/size}"
        call school_ended
    if book_07_units == 6:
        "Глава [book_07_units]" "{size=-2}Хулиган отбирает ваши деньги на обед. Позже Ши приводит хулигана он извиняется и возращает деньги на обед. Ши может быть опасной девченкой...{/size}"
        call school_ended
    if book_07_units == 7:
        "Глава [book_07_units]" "{size=-2}Другой скучный урок. Вы полностью игнорируете учителя и мечтаете о получении степени в искусстве, что бы стать художником по хентай-манге.{/size}"
        call school_ended
    if book_07_units == 8:
        "Глава [book_07_units]" "{size=-2}Еще один ужасный школьный день, Мисс Стивенс одета в скромный зеленый костюм,  скрывающий её привлекательную фигуру. Вы не можете сосредоточиться на ее уроке.{/size}" 
        call school_ended
    if book_07_units == 9:
        "Глава [book_07_units]" "{size=-2}Вы сорвали занятие и бродите по пустынным школьным коридорам, делая вид, что вы единственный оставшийся в живых из-за какого-то смертельного вируса. Дворник замечает вас, он заражен! Вы убегаете дабы выжить.{/size}" 
        call school_ended
    if book_07_units == 10:
        "\"Глава [book_07_units]\"" "{size=-2}Хулиган вновь отбирает деньги. Час спустя скорая забирает в парке перед школой парня со сломанной рукой. Вы узнаете в нем хулигана... Это Ши сделала с ним?{/size}"
        call school_ended
    if book_07_units == 11:
        "\"Глава [book_07_units]\"" "{size=-2}Еще день в школе . После случая с хулиганом люди вокруг смотрят на Ши с еще большим обожаниям.Как она делает это?{/size}"
        call school_ended
    if book_07_units == 12:
        "\"Глава [book_07_units]\"" "{size=-2}У вас сегодня нет занятий с Мисс Стивенс . Так зачем беспокоится? Вы засыпаете за своим столом.{/size}"
        call school_ended
    if book_07_units == 13:   
        "\"Глава [book_07_units]\"" "{size=-2}Все ваши одноклассники взволнованы предстоящим выпускным, но вам кажется это полной глупостью.{/size}"
        call school_ended
    if book_07_units == 14:
        "\"Глава [book_07_units]\"" "{size=-2}Еще один скучный урок. Вы смотрете в окно и обратили на черный тонированный фургон стоящей у школьной библиотеке. Зачем?{/size}"
        call school_ended
    if book_07_units == 15:
        "\"Глава [book_07_units]\"" "{size=-2}Вы подслушали как ваши однокласники говорили о \"фан клубе мисс Стивенс\". Не очень удивительно при том какая она привлекательная.{/size}"
        call school_ended
    if book_07_units == 16:
        "\"Глава [book_07_units]\"" "{size=-2}С каждым днем все вокруг всё больше волнуются из-за выпускного. You toy with an idea of asking someone to the prom, but decide to save yourself the awkwardness.{/size}" 
        call school_ended
    if book_07_units == 17:
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс снова надела обтягивающий костим сегодня. Все парни стараються лучше учиться, а девчонки сильно обижены.{/size}"
        call school_ended
    if book_07_units == 18:
        "\"Глава [book_07_units]\"" "{size=-2}Выпускной завтра. все очень взволнованы, но вы просто хотите, что бы день поскорее закончился.{/size}"
        call school_ended
    if book_07_units == 19:
        "\"Глава [book_07_units]\"" "{size=-2}Сегодня выпускной. вы видите своих однокласников очень взволнованных перед церемонией, но вам все равно.{/size}"
        call school_ended
    if book_07_units == 20:
        "\"Глава [book_07_units]\"" "{size=-2}Выпускной будет сегодня вечером. У вас нет планов на сегодня, ни по дому, ни домашнего задания... Так что вы свободны!?{/size}"
        if complited_leena_already and complited_shea_already and complited_stevens_already and victoria >= 1 and shea >= 1 and leena >= 1:
            "\"Глава [book_07_units]\"" "{size=-2}Вы решаете пойти на выпускной и с удивлением увидели \"библиотекаршу\" здесь. Она приглашает вас на танец и целует. Вы заметил Ши смотрящую на вас с недоверием.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}\"Библиотекарша\" выводит вас на улицу. Она начинает целовать вас и, хватая ваш член, начинает дрочить вам. Вдруг из-за угла появляется Ши.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Ши злится и начинает кричать на девушку, которая все еще дрочит вам. На крики Ши прибегает мисс Стивенс и видит вас со все еще спущенными штанами.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Смущаясь, вы натягиваете свои штаны. Она спокойно обходит свою машину и зовет всех вас. Вы садитесь и она увозит вас в мотель. Она снова замечает ваши спущенные штаны и показывает на них.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}В комнате она хватает вас за член и начинает дрочить его. В это время Ши стоит в шоке, а \"библиотекарша\" начинает вас целовать.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Неохотно Ши присоединяется к вам. Вы решаете трахнуть в первую очередь свою сводную сестренку, конечно же в попку. \"Библиотекарша\" будет следующей, а за ней и мисс Стивенс{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Когда вы просыпаетесь, то обнаруживаете, что все, кроме Ши ушли. Ваша сестренка еще спит. Вы раздвигаете ее попку и и вставляете свой утренний кол в ее сладкую попку. -Конец-{/size}"
            "\"Эпилог\"" "{size=-2}Спустя год. Мисс стивенс все так же работает в школе и встречается с темноволосой девушкой ... у вас нет предположений, что с ней стало.{/size}"
            "\"Эпилог\"" "{size=-2}Вы и Ши учитесь в одном университете...{/size}"
            "\"Эпилог\"" "{size=-2}Вы были вместе в том отеле, но вам нужно хранить это в секрете. Единственное, что вас заботит, так это бешеный аппетит вашей сестренки к анальному сексу. -Конец-{/size}"
            "\"Эпилог\"" "{size=-2}-Концовка 05 из 05-{/size}" #HAREM IS ENDING # 5.
            return
        else:
            menu:
                "Что бы вы хотели сделать в оставшуюся часть дня?"
                "-Бродить у школы (Страница 78)-":
                    if victoria >= 7:
                        "\"Глава [book_07_units]\"" "{size=-2}Школьный спортзал полон всевозможных украшений . Мисс Стивенс глава комитета и она кажется очень сильно занята.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Вы говорите Мисс Стивенс о своем решении пропустить выпускной. Она злится, хватает вас за промежность и шепчет, что позволит кончит её на лицо если вы передумаете.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Вечером того же дня вы приходите на выпускной. Вы танцуете с мисс Стивенс, она отводит вас к шкавчику дворника и начинает дрочить вам себе на лицо. Вы кончаете ей на лицо.{/size}"
                        $ victoria_waifu = True #Completed the book with ms.Stevens.
                        "\"Эпилог\"" "{size=-2}Спустя год... Вы пытались оставатся в контакте с мисс Стивенс, но похоже после того как вы перестали быть её учеником она потеряла к вам интерес.{/size}"
                        "\"Эпилог\"" "{size=-2}Но этот опыт мотивировал вас следовать за своей мечтой стать художником в журнале для взрослых. Теперь вы посещаете школу искусств и вы счастливы.{/size}"
                        "\"Эпилог\"" "{size=-2}-Концовка 03 из 05-{/size}" #Ms.Stevens IS ENDING # 3.
                        return
                    if victoria >= 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Школьный спортзал полон всевозможных украшений . Мисс Стивенс глава комитета и она кажется очень сильно занята.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Она замечает вас. Вы говорите её о своем решении пропустить выпускной , но её видимо это совсем не заботит.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
                        call epilogue
                        return
                    if victoria < 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. What of time the whole thing is...{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
                        call epilogue
                        return
                "-Остаться дома (Страница 51)-":
                    if shea >= 8: #1
                        "\"Глава [book_07_units]\"" "{size=-2}Вы решили остатся дома, к вашему удивлению Ши тоже осталась дома. Затем внезапно она приглашает вас пойти на выпускной.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Выпускной проходит в общем норманьно. Вы танцуете со сводной сестрой и все вокруг думают, что это потому что она сжалтлась над вами.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Когда выпускной заканчивается вы с Ши возращаетесь домой. That night you take your little stepsister's virginity. And then she asks you to stick it up her butt as well.{/size}"
                        "\"Эпилог\"" "{size=-2}Спустя год. Вы и Ши пошли в один и тот же университе, хотя вы и выбрали разные специальности, но вы попрежнему вместе и счастливы. -КОНЕЦ-{/size}"
                        $ shea_waifu = True #Completed the book with Shea.
                        "\"Эпилог\"" "{size=-2}-Концовка 02 из 05-{/size}" #SHEA IS ENDING # 2.
                        return
                    if shea >= 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы решили остатся дома, к вашему удивлению Ши тоже осталась дома. You toy with the idea of asking her out to the prom but then decide against it.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Ши идет на выпускной с другим парнем, а вы остаетесь дома.{/size}"
                        call epilogue
                        return
                    if shea < 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы решили остатся дома и не ходить на выпускной.{/size}"
                        call epilogue
                        return
                "-Бродить вокруг библиотеки (Страница 97)-":
                    if leena >= 8:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Вы идете к своему обычному месту. Вы удивлены увидев брюнетку под своим столом.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Двое мужчин в черных костюмах выглядели так, как будто она положила их члены в свой рот. Они встали на ее сторону, а вы просто стояли там ошеломленный таким исходом событий, со спущенными штанами. Что это за херня?/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Рано утром на вашем пороге появляется девушка. Она говорит, что находится под программой защиты свидетелей, но из-за вас ее прикрытие под угрозой.{/size}"
                        $ leena_waifu = True #Completed the book with Leena.
                        "\"Эпилог\"" "{size=-2}Спустя два года . Вы и \"Девушка из библиотеке\" поженились. Вы живете в домике на пляже под новым именем.{/size}" 
                        "\"Эпилог\"" "{size=-2}Вы очень её любите и оставили ради неё свое прошлое позади, она так благодарна вам, что очень часто делает вам потрясающий миньет. -Конец-{/size}"
                        "\"Эпилог\"" "{size=-2}-Концовка 04 из 05-{/size}" #LEENA IS ENDING # 4.
                        return
                    if leena >= 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Внезапно появляется девушка из неоткуда и садится рядом с вами.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Она начинает говорить с вами что её зовут Лина, но вдруг появляются двое мужчин в черных костумах. Вы видете страх в её глазах. Вы хотели бы сделать что то...{/size}"
                        call epilogue
                        return
                    if leena < 4: 
                        "\"Глава [book_07_units]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Через некоторое время вы уходите домой и ложитесь спать.{/size}"
                        call epilogue
                        return
        
    return       
        

###
label school_ended:
    $ page_01 = renpy.random.randint(1, 30)  
    $ page_02 = renpy.random.randint(31, 60) 
    $ page_03 = renpy.random.randint(61, 100) 
    menu:
        "Глава [book_07_units]" "{size=-2}Школьные занятия закончены . Как бы вы хотели провести остаток дня?{/size}"
        "-Бродить у школы (Страница [page_03])-":
            if book_07_units == 1:
                call home_victoria
            if book_07_units == 2:
                call at_school
            if book_07_units == 3:
                call at_school
            if book_07_units == 4:
                call home_victoria #Date2
            if book_07_units == 5:
                call at_school
            if book_07_units == 6:
                call home_victoria #Date3
            if book_07_units == 7:
                call home_victoria #Date4
            if book_07_units == 8:
                call at_school
            if book_07_units == 9:
                call at_school
            if book_07_units == 10:
                call home_victoria #Date5
            if book_07_units == 11:
                call at_school
            if book_07_units == 12:
                call at_school
            if book_07_units == 13:
                call home_victoria #Date6
            if book_07_units == 14:
                call at_school
            if book_07_units == 15:
                call home_victoria #Date7
            if book_07_units == 16:
                call home_victoria #Date8
            if book_07_units == 17:
                call at_school
            if book_07_units == 18:
                call home_victoria #Date9
            if book_07_units == 19:
                call at_school
            if book_07_units == 20:
                call home_victoria #Date10
                
        "-Идти домой (Страница [page_01])-":
            if book_07_units == 1:
                call home_shea #1
            if book_07_units == 2:
                call home_shea #2
            if book_07_units == 3:
                call im_home
            if book_07_units == 4:
                call im_home
            if book_07_units == 5:
                call im_home
            if book_07_units == 6:
                call home_shea #3
            if book_07_units == 7:
                call im_home
            if book_07_units == 8:
                call im_home
            if book_07_units == 9:
                call home_shea #4
            if book_07_units == 10:
                call home_shea #5
            if book_07_units == 11:
                call im_home
            if book_07_units == 12:
                call home_shea #6
            if book_07_units == 13:
                call im_home
            if book_07_units == 14:
                call home_shea #7
            if book_07_units == 15:
                call home_shea #8
            if book_07_units == 16:
                call im_home
            if book_07_units == 17:
                call home_shea #9
            if book_07_units == 18:
                call im_home
            if book_07_units == 19:
                call im_home
            if book_07_units == 20:
                "ПОПКА"
                call home_shea

        "-Идти к библиотеке (Страница [page_02])-":
            if book_07_units == 1:
                call at_library
            if book_07_units == 2:
                call at_library
            if book_07_units == 3:
                call at_library
            if book_07_units == 4:
                call home_leena #1
            if book_07_units == 5:
                call at_library
            if book_07_units == 6:
                call home_leena #2
            if book_07_units == 7:
                call home_leena #3
            if book_07_units == 8:
                call home_leena #4
            if book_07_units == 9:
                call at_library
            if book_07_units == 10:
                call home_leena #5
            if book_07_units == 11:
                call at_library
            if book_07_units == 12:
                call home_leena #6
            if book_07_units == 13:
                call home_leena #7
            if book_07_units == 14:
                call at_library
            if book_07_units == 15:
                call at_library
            if book_07_units == 16:
                call home_leena #8
            if book_07_units == 17:
                call at_library
            if book_07_units == 18:
                call home_leena #8
            if book_07_units == 19:
                call at_library
            if book_07_units == 20:
                call home_leena #8
    
    
    
    
    
    return

        
        
### DATES ###
label home_shea:
    if shea == 0: #1
        "\"Глава [book_07_units]\"" "{size=-2}Вы входите в дом и идете в ванну, где сейчас находится Ши. Вы пялитесь на ее сиськи, в то время, как она пытается вытолкнуть вас своими коронными ударами.{/size}"
    if shea == 1: #2
        "\"Глава [book_07_units]\"" "{size=-2}Дома, Ши готовит супчик для вас. Вы мельком замечаете ее трусики и она снова ударяет вас.{/size}"
    if shea == 2: #3
        "\"Глава [book_07_units]\"" "{size=-2}Вы возвращаетесь домой и понимаете, что дома никого. Вы решаете посмотреть какое-нибудь порно в гостиной. Ши возвращается с прогулки и видит вас. Она опять начинает бить вас.{/size}"        
    if shea == 3: #4
        "\"Глава [book_07_units]\"" "{size=-2}Сегодня погода на улице очень испортилась. Началась гроза. Ши, испугавшись залазит в вашу постель. Упираясь в ваш твердый член, она шугается и начинает бить вас.{/size}"
    if shea == 4: #5
        "\"Глава [book_07_units]\"" "{size=-2}Пока все спокойно, вы решаете убраться в комнате Ши. Она не оценила ваше вторжение и начала вас бить. {/size}"
    if shea == 5: #6
        "\"Глава [book_07_units]\"" "{size=-2}Дома никого нет. Вы решаете посмотреть порнуху в гостиной. Внезапно Ши возвращается с прогулки. Вы ожидаете, что она начнет вас бить, но нет, она просто убегает{/size}"
    if shea == 6: #7
        "\"Глава [book_07_units]\"" "{size=-2}Вы решаете извиниться и идете в комнату Ши. На ней надета прелестная ночнушка. Вы извиняетесь, это дается несколько труднее, чем вы думали, но она принимает ваши извенения, хоть и слегка краснея.{/size}" 
    if shea == 7: #8
        "\"Глава [book_07_units]\"" "{size=-2}Снова на улице портится погода. Ши опять залазит вам в кровать. Она целует вас и просит вас лишить ее анальной девственности. Вы занимаетесь анальным сексом со своей сестренкой. {/size}"
    if shea == 8: #9
        "\"Глава [book_07_units]\"" "{size=-2}Ши проскальзывает в вашу комнату. В то время, как ваши родители заканчивают ужинать внизу, вы бурите сладкую попку своей сестренки, которая с радостью принимает вас. {/size}"
    $ shea += 1            
    return

### DATES ###
label home_victoria:
    if victoria == 0: #1
        "\"Глава [book_07_units]\"" "{size=-2}Вы решаете побродить по вокруг школы. Мисс Стивенс сидит в одном из классов и вы решаете тайно за ней понаблюдать.{/size}"
    if victoria == 1: #2
        "\"Глава [book_07_units]\"" "{size=-2}Вы видите как мисс Стивенс опять работает в пустом классе. На этот раз она замечает вас, и вы должны быстро свалить отсюда, но у вас ничего не выходит. Она дает вам большое домашнее задание.{/size}"
    if victoria == 2: #3
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс находит вас бродящим по пустым коридорам школы. Вы не выполнили ее задание, но она уже дала вам следующее. Пока что она презирает тебя.{/size}"
    if victoria == 3: #4
        "\"Глава [book_07_units]\"" "{size=-2}Вы снова натыкаетесь на мисс Стивенс. Похоже она преследует вас. Она снова дает вам еще одно задание. Вы потихоньку начинаете ненавидить женщин. {/size}"
    if victoria == 4: #5
        "\"Глава [book_07_units]\"" "{size=-2}Вы пытаетесь избежать мисс Стивенс, но неудачно. Она снова дает вам задание и начинает причитать о том, что бывает в жизни с такими плохими учениками как ты.{/size}"
    if victoria == 5: #6
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс ведет у вас урок. Внезапно оно случайно проливает чай вам на колени. Она пытается убрать все с ваших колен наклонившись и начав стирать жидкость куском ткани. Она делает вид, что не замечает как вы возбуждаетесь{/size}" 
    if victoria == 6: #7
        "\"Глава [book_07_units]\"" "{size=-2}Вы снова сидите на лекци мисс Стивенс. Вдруг она целует вас в губи и тут же извиняется. Она просит держать вас это в секрете. Вы очень смущены и возвращаетесь домой. {/size}" 
    if victoria == 7: #8
        "\"Глава [book_07_units]\"" "{size=-2}Вы решаете попродить у школы, в надежде встретить мисс Стивенс. Но ее нигде нет...{/size}"  
    if victoria == 8: #9
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс вызывает вас к себе. В момент она хватает вас за член и начинает его ласкать, после чего просто отпускает вас. Домой вы возвращаетесь в очень хорошем настроении. {/size}"   
    $ victoria += 1            
    return


### DATES ###
label home_leena:
    if leena == 0: #1
        "\"Глава [book_07_units]\"" "{size=-2}Вы идете в библиотеку. Вы замечаете темноволосую девушку в очках, возможно просто посетитель. Остаток времени вы проводите за чтение научно-фантастической литературы.{/size}"
    if leena == 1: #2
        "\"Глава [book_07_units]\"" "{size=-2}Вы пришли в библиотеку. Опять эта девушка в очках. Вы читаете свои научные книги и замечаете, как девушка смотрит на вас. У нее какие-то проблемы? {/size}"
    if leena == 2: #3
        "\"Глава [book_07_units]\"" "{size=-2}Похоже, что та девушка всегда здесь. В этот раз вы всматриваетесь в нее более детально: длинные темные волосы, очки, отличное тело. Она довольно милая, но вдруг она ловит ваш взгляд на себе. {/size}"       
    if leena == 3: #4
        "\"Глава [book_07_units]\"" "{size=-2}Та девушка как обычно здесь. Она вероятно застенчива, тут вы решаете заговорить с ней, но она игнорирует вас и просто уходит. Она очень странная.{/size}"    
    if leena == 4: #5
        "\"Глава [book_07_units]\"" "{size=-2}Сегодня той девушки нет. Вы занимаете свое обычное место и находите от нее записку. Она извиняется и признается, что влюблена в вас и просит прощения за тот раз.{/size}"
    if leena == 5: #6
        "\"Глава [book_07_units]\"" "{size=-2}Вы снова здесь. Девушки, как и записки от нее, нет. Вы не можете вспомнить, видели ли вы эту красивую застенчивую девчушку ранеее, кроме как в тот раз. {/size}"
    if leena == 6: #7
        "\"Глава [book_07_units]\"" "{size=-2}Вы пытаетесь вчитаться, но просто не можете сосредоточиться. Вдруг рядом с вами садится эта девушка. Вы ждете объяснений, но она притворяется, что просто читает. {/size}"
    if leena == 7: #8
        "\"Глава [book_07_units]\"" "{size=-2}Вы снова приходите и делаете вид, что читаете. Девушка опять садится рядом с вами и начинает массировать ваш член. Что с ней такое?{/size}"
    if leena == 8: #9
        "\"Глава [book_07_units]\"" "{size=-2}Как только вы появляетесь, девушка сразу тащит вас за книжные полки и просит трахнуть её. Вы кончаете, наполняя ее своей спермой. Она возращается на свое место в то время, как вы продолжаете стоять там же в растеренности после всего этого.{/size}"   
    $ leena += 1            
    return
        
        
        
        
        
        

### HOME ###
label im_home:
$ random_home = renpy.random.randint(1, 5)      
if random_home == 1:
    "\"Глава [book_07_units]\"" "{size=-2}Вы вернулись домой. Дом пуст. Вы решили поиграть в видеоигры до вечера.{/size}"
if random_home == 2:
    "\"Глава [book_07_units]\"" "{size=-2}}Вы вернулись домой. Дом пуст. Вы решили смотреть фильмы для взрослых в гостинной.{/size}"
if random_home == 3:
    "\"Глава [book_07_units]\"" "{size=-2}Вы вернулись домой. Ваш отец дома. Вы решаете пойти на пробежку, что бы уйти от неудобных вопросов про вашу личную жизнь.{/size}"
if random_home == 4:
    "\"Глава [book_07_units]\"" "{size=-2}Вы вернулись домой. Ваша мачеха дома . Вы слушаете её снова и снова о чём то банальном и не понимаете почему отец решил женится на ней.{/size}"
if random_home == 5:
    "\"Глава [book_07_units]\"" "{size=-2}Вы вернулись домой. Дом пуст.Вы решили воспользоваться моментов, что бы вздремнуть.{/size}"
return
    

### SCHOOL ###
label at_school:
    $ random_home = renpy.random.randint(1, 5)      
    if random_home == 1:
        "\"Глава [book_07_units]\"" "{size=-2}Вы идете на школьный стадион, что бы раслабиться на трибунах, пока вы наблюдаете за чирлидершами из далека...{/size}"
    if random_home == 2:
        "\"Глава [book_07_units]\"" "{size=-2}Вы проникаете в свое секретное место на школьной крыше, и смотрите на надвигающиеся тяжелые тучи в далеке, в надежде что сегодня пойдет дождь ..{/size}"
    if random_home == 3:
        "\"Глава [book_07_units]\"" "{size=-2}Вы бродите по пустым коридорам школы и видете дворника. Он бросает на вас подозрительный взгляд и уходит по своим делам. Вы отпровляетесь домой.{/size}" 
    if random_home == 4:
        "\"Глава [book_07_units]\"" "{size=-2}Вы покупаете плитку шоколада, а затем проникаете в один из пустых классов, что бы почитать свою любимую книгу по научной фантастике.{/size}" 
    if random_home == 5:
        "\"Глава [book_07_units]\"" "{size=-2}Вы бродите по пустым школьным коридорам некоторое время . Начинается дождь. Ваша сводная сестра Ши боится грома и вы надеетесь, что ночью будет шторм.{/size}"                               
return 

### LIBRARY ###
label at_library:
    $ random_home = renpy.random.randint(1, 5)      
    if random_home == 1:
        "\"Глава [book_07_units]\"" "{size=-2}Вы возвращаетесь в школьную библиотеку и обращаете внимания на мужчину в черном костюме у входа. Вы пытаетесь пройти, но он игнорирует вас.{/size}"
    if random_home == 2:
        "\"Глава [book_07_units]\"" "{size=-2}Вы провели остаток дня сидя в библиотеке, читая вашу научно-фантастическую книгу, вздремнули, купили конфет из автомата а затем почитали еще немного. Жизнь прекрасна!{/size}" 
    if random_home == 3:
        "\"Глава [book_07_units]\"" "{size=-2}Вы просматриваете древние на вид книжные полки, надеясь найти давно забытые книги занклинаний или чего-то еще, но вам становится скучно и вы уходите домой.{/size}"
    if random_home == 4:
        "\"Глава [book_07_units]\"" "{size=-2}Библиотека пуста, так что вы прячетесь за книжными полками и дрочите думая о мисс Стивенс .{/size}"
    if random_home == 5:
        "\"Глава [book_07_units]\"" "{size=-2}Вы услышали голоса и спрятались за книжной полкой. Оттуда вы видите чирлидершу сразу с двумя спортсменами, вы решаете уйти что бы не попасть в неприятности.{/size}"
    return


### Epilogue
label Эпилог:
    "\"Эпилог\"" "{size=-2}Всякое произошло за этот год. Вы поступили в университет за рубежом и вам нравится учиться, так что вы редко думаете о прошлом и возлагаете большие надежды на будущее.{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 01 из 04-{/size}"
    return
        
        
### HAREM ###        
        
        
        
        
        
        
        
        
        
        