label waifu:
    if book_07_units == 1:
        "Глава [book_07_units]" "{size=-2}Вы - подросток, который делит дом с милой сводной сестрой Ши. Чем вы займетесь сегодня после школы?{/size}"
        if not complited_leena_already and not complited_stevens_already and not complited_shea_already:
            m "Ооо, это одна из \"тех\" книг. Хорошо, посмотрим..."
        call school_ended
    if book_07_units == 2:
        "Глава [book_07_units]" "{size=-2}Во время занятий мисс Стивенс что-то нудит. Вы смотрите на её грудь, чтобы не уснуть. Она слишком секси для училки.{/size}"
        call school_ended
    if book_07_units == 3:
        "Глава [book_07_units]" "{size=-2}Вы встречаете свою сводную сестру в школе. В отличие от вас, Ши довольно популярна среди одноклассников. Но вас она игнорирует.{/size}"
        call school_ended
    if book_07_units == 4:
        "Глава [book_07_units]" "{size=-2}Вы столкнулись в коридоре с девушкой, она носит очки с толстыми линзами и очень застенчива. Она извиняется и быстро убегает. Она тоже учится в этой школе?{/size}"
        call school_ended
    if book_07_units == 5:
        "Глава [book_07_units]" "{size=-2}Сегодня мисс Стивенс устроила внеклассные мероприятия. Вы решаете проявить себя, чтобы быть на хорошем счету.{/size}"
        call school_ended
    if book_07_units == 6:
        "Глава [book_07_units]" "{size=-2}Хулиган отбирает ваши деньги на обед. Ши замечает это и вскоре приводит хулигана, он извиняется и возращает деньги. Ши может быть опасной девчонкой...{/size}"
        call school_ended
    if book_07_units == 7:
        "Глава [book_07_units]" "{size=-2}Еще один скучный урок. Вы не слушаете учителя и мечтаете закончить художественный колледж, чтобы стать художником по хентай-манге.{/size}"
        call school_ended
    if book_07_units == 8:
        "Глава [book_07_units]" "{size=-2}Еще один ужасный школьный день. Скромный зеленый костюм Мисс Стивенс только подчеркивает ее соблазнительные формы. Вы не можете сосредоточиться на уроке.{/size}" 
        call school_ended
    if book_07_units == 9:
        "Глава [book_07_units]" "{size=-2}Вы сбежали с урока и бродите по пустынным школьным коридорам, делая вид, что вы единственный оставшийся в живых из-за какого-то смертельного вируса. Уборщик замечает вас, он заражен! Вы убегаете, дабы выжить.{/size}" 
        call school_ended
    if book_07_units == 10:
        "\"Глава [book_07_units]\"" "{size=-2}Хулиган вновь отбирает деньги. Час спустя скорая забирает в парке перед школой какого-то парня со сломанной рукой. Вы узнаете в нем того самого хулигана... Это Ши его обработала?{/size}"
        call school_ended
    if book_07_units == 11:
        "\"Глава [book_07_units]\"" "{size=-2}Еще один школьный день. После случая с хулиганом люди смотрят на Ши с еще большим обожанием. Как у нее это получается?{/size}"
        call school_ended
    if book_07_units == 12:
        "\"Глава [book_07_units]\"" "{size=-2}У вас сегодня нет занятий с Мисс Стивенс. Так о чем беспокоиться? Вы засыпаете за партой.{/size}"
        call school_ended
    if book_07_units == 13:   
        "\"Глава [book_07_units]\"" "{size=-2}Все ваши одноклассники взволнованы предстоящим выпускным, но вы выше подобной хренотени.{/size}"
        call school_ended
    if book_07_units == 14:
        "\"Глава [book_07_units]\"" "{size=-2}Еще один скучный урок. В окно вы замечаете стоящий у школьной библиотеки подозрительный черный фургон с тонированными стеклами. Какого черта он там делает?{/size}"
        call school_ended
    if book_07_units == 15:
        "\"Глава [book_07_units]\"" "{size=-2}Вы подслушали, как ваши однокласники говорят о \"фан клубе мисс Стивенс\". Неудивительно, учитывая какая она секси.{/size}"
        call school_ended
    if book_07_units == 16:
        "\"Глава [book_07_units]\"" "{size=-2}В школе только и разговоров, что о выпускном. Вы подумываете пригласить кого-нибудь, но не можете побороть свою стеснительность.{/size}" 
        call school_ended
    if book_07_units == 17:
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс снова надела обтягивающий костюм. Все парни стараются проявится в учебе, а девчонки злятся.{/size}"
        call school_ended
    if book_07_units == 18:
        "\"Глава [book_07_units]\"" "{size=-2}Выпускной завтра, все очень взволнованы, но вы просто хотите, чтобы этот день поскорее прошел.{/size}"
        call school_ended
    if book_07_units == 19:
        "\"Глава [book_07_units]\"" "{size=-2}Сегодня выпускной. Ваши одноклассники очень взволнованны церемонией, но вам плевать.{/size}"
        call school_ended
    if book_07_units == 20:
        "\"Глава [book_07_units]\"" "{size=-2}Выпускной сегодня вечером. У вас нет ни планов на сегодня, ни работы по дому, ни домашнего задания... Так что вы свободны!?{/size}"
        if complited_leena_already and complited_shea_already and complited_stevens_already and victoria >= 1 and shea >= 1 and leena >= 1:
            "\"Глава [book_07_units]\"" "{size=-2}Вы решаете пойти на выпускной и с удивлением встречаете \"билиотекаршу\" здесь. Она приглашает вас на танец и целует. Вы видите Ши, которая недоверчиво пялится на вас.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}\"Библиотекарша\" выводит вас на улицу. Она начинает целовать вас, забирается к вам в штаны и принимается дрочить. Вдруг из-за угла появляется Ши.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Ши дико злится и начинает кричать на девушку, которая не перестает дрочить вам. На крики Ши прибегает мисс Стивенс и видит вас со спущенными штанами.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Красный и совершенно сбитый с толку вы натягиваете штаны. Мисс Стивенс спокойно уходит, чтобы через минуту подъехать на машине. Она везет вас всех в мотель.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}В комнате мотеля она хватает вас за промежность и начинает дрочить. Ши стоит в шоке, а \"библиотекарша\" принимается вас целовать.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Неохотно Ши присоединяется. Вы решаете трахнуть сперва сводную сестренку, конечно же, в попку. \"Библиотекарша\" следующая на очереди, а за ней и мисс Стивенс.{/size}"
            "\"Глава [book_07_units]\"" "{size=-2}Проснувшись утром, вы обнаруживаете, что все, кроме Ши, ушли. Ваша сестренка еще спит. Вы раздвигаете ее ягодицы и вставляете свой утренний кол в ее сладкую попку. -Конец-{/size}"
            "\"Эпилог\"" "{size=-2}Прошел год. Мисс Стивенс все так же работает в школе, что же касается темноволосой девушки ... вы не знаете, что с ней стало.{/size}"
            "\"Эпилог\"" "{size=-2}Вы с Ши учитесь в одном университете...{/size}"
            "\"Эпилог\"" "{size=-2}Вы вместе с той ночи в отеле, но до сих пор храните вашу связь в секрете. Единственное, что вас заботит, так это бешеный аппетит вашей сестренки к анальному сексу. -Конец-{/size}"
            "\"Эпилог\"" "{size=-2}-Концовка 05 из 05-{/size}" #HAREM IS ENDING # 5.
            return
        else:
            menu:
                "Чем вы займетесь вечером?"
                "- Бродить около школы (Страница 78) -":
                    if victoria >= 7:
                        "\"Глава [book_07_units]\"" "{size=-2}Школьный спортзал украшен к сегодняшнему выпускному. Мисс Стивенс - глава комитета и, кажется, очень сильно занята.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Вы говорите Мисс Стивенс, что решили пропустить выпускной. Она злится, хватает вас за промежность и шепчет, что позволит кончить ей на лицо, если вы передумаете.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Вечером того же дня вы приходите на выпускной. Вы танцуете с мисс Стивенс, она отводит вас к шкафчику уборщиков и начинает дрочить вам. Вы кончаете ей на лицо.{/size}"
                        $ victoria_waifu = True #Completed the book with ms.Stevens.
                        "\"Эпилог\"" "{size=-2}Прошел год... Вы пытались оставатся в контакте с мисс Стивенс, но после того как вы перестали быть её учеником, она потеряла к вам всякий интерес.{/size}"
                        "\"Эпилог\"" "{size=-2}Но этот опыт с ней подтолкнул вас продолжать следовать за мечтой и стать художником в журнале для взрослых. Теперь вы посещаете школу искусств и счастливы.{/size}"
                        "\"Эпилог\"" "{size=-2}-Концовка 03 из 05-{/size}" #Ms.Stevens IS ENDING # 3.
                        return
                    if victoria >= 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Школьный спортзал украшен к сегодняшнему выпускному. Мисс Стивенс - глава комитета и, кажется, очень сильно занята.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Она замечает вас. Вы говорите, что решили пропустить выпускной, но её, видимо, это совсем не заботит.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
                        call epilogue
                        return
                    if victoria < 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Школьный спортзал украшен к сегодняшнему выпускному. И зачем это все...{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
                        call epilogue
                        return
                "- Остаться дома (Страница 51) -":
                    if shea >= 8: #1
                        "\"Глава [book_07_units]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению Ши тоже остается. Затем, внезапно, она приглашает вас пойти с ней на выпускной.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Выпускной проходит обычно. Вы танцуете со сводной сестрой и все вокруг думают, что это она сжалилась над вами.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Когда выпускной заканчивается, вы с Ши возращаетесь домой. Этой ночью вы лишатет свою сестренку девстенности. Затем она просит попробовать ее попку. {/size}"
                        "\"Эпилог\"" "{size=-2}Прошел год. Вы и Ши пошли в один и тот же университет. Хотя вы и выбрали разные специальности, но вы по-прежнему вместе и счастливы. -Конец-{/size}"
                        $ shea_waifu = True #Completed the book with Shea.
                        "\"Эпилог\"" "{size=-2}-Концовка 02 из 05-{/size}" #SHEA IS ENDING # 2.
                        return
                    if shea >= 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению Ши тоже осталась дома. Ваш долго собираетесь с духом пригласить ее на выпускной, но так и не решаетесь.{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Ши идет на выпускной с другим парнем, а вы так и остаетесь дома.{/size}"
                        call epilogue
                        return
                    if shea < 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы решили остаться дома и не ходить на выпускной.{/size}"
                        call epilogue
                        return
                "- Бродить вокруг библиотеки (Страница 97) -":
                    if leena >= 8:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы забиваете на выпускной и идете в библиотеку. Она пуста, вы садитесь на свое обычное место... и с удивлением замечаете брюнетку под вашим столом.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Но как только она берет ваш член в рот, появляются двое мужчин в черных костюмах. Они забирают ее, а вы остаетесь остолбеневший и со спущенными штанами. Что за херня?!{/size}"
                        "\"Глава [book_07_units]\"" "{size=-2}Рано утром на вашем пороге появляется девушка. Она говорит, что находится под программой защиты свидетелей, но из-за вас ее прикрытие под угрозой.{/size}"
                        $ leena_waifu = True #Completed the book with Leena.
                        "\"Эпилог\"" "{size=-2}Прошло два года. Вы и \"Девушка из библиотеки\" поженились. Вы живете в домике на пляже в малолюдном месте под новыми именами.{/size}" 
                        "\"Эпилог\"" "{size=-2}Вы очень её любите и оставили ради неё свое прошлую жизнь. Она так благодарна вам, что большую часть времени ваш член гостит в ее рту. -Конец-{/size}"
                        "\"Эпилог\"" "{size=-2}-Концовка 04 из 05-{/size}" #LEENA IS ENDING # 4.
                        return
                    if leena >= 4:
                        "\"Глава [book_07_units]\"" "{size=-2}Вы забиваете на выпускной и идете в библиотеку. Там пусто и вы садитесь на обычное место. Внезапно появляется черноволосая девушка и садится рядом с вами.{/size}" 
                        "\"Глава [book_07_units]\"" "{size=-2}Она говорит, что её зовут Лина, но вдруг появляются двое мужчин в черных костюмах. Вы видете, как она испугана, когда они забирают ее с собой. Вы хотели бы сделать что-то, но...{/size}"
                        call epilogue
                        return
                    if leena < 4: 
                        "\"Глава [book_07_units]\"" "{size=-2}Вы забиваете на выпускной и идете в библиотеку. Здесь пусто и вы садитесь на обычное место. Но вам скучно и вскоре вы уходите домой и ложитесь спать.{/size}"
                        call epilogue
                        return
        
    return       
        

###
label school_ended:
    $ page_01 = renpy.random.randint(1, 30)  
    $ page_02 = renpy.random.randint(31, 60) 
    $ page_03 = renpy.random.randint(61, 100) 
    menu:
        "Глава [book_07_units]" "{size=-2}Школьные занятия закончены. Как вы проведете остаток дня?{/size}"
        "- Бродить у школы (Страница [page_03]) -":
            if book_07_units == 1:
                call home_victoria
            if book_07_units == 2:
                call at_school
            if book_07_units == 3:
                call at_school
            if book_07_units == 4:
                call home_victoria #Date2
            if book_07_units == 5:
                call at_school
            if book_07_units == 6:
                call home_victoria #Date3
            if book_07_units == 7:
                call home_victoria #Date4
            if book_07_units == 8:
                call at_school
            if book_07_units == 9:
                call at_school
            if book_07_units == 10:
                call home_victoria #Date5
            if book_07_units == 11:
                call at_school
            if book_07_units == 12:
                call at_school
            if book_07_units == 13:
                call home_victoria #Date6
            if book_07_units == 14:
                call at_school
            if book_07_units == 15:
                call home_victoria #Date7
            if book_07_units == 16:
                call home_victoria #Date8
            if book_07_units == 17:
                call at_school
            if book_07_units == 18:
                call home_victoria #Date9
            if book_07_units == 19:
                call at_school
            if book_07_units == 20:
                call home_victoria #Date10
                
        "- Идти домой (Страница [page_01]) -":
            if book_07_units == 1:
                call home_shea #1
            if book_07_units == 2:
                call home_shea #2
            if book_07_units == 3:
                call im_home
            if book_07_units == 4:
                call im_home
            if book_07_units == 5:
                call im_home
            if book_07_units == 6:
                call home_shea #3
            if book_07_units == 7:
                call im_home
            if book_07_units == 8:
                call im_home
            if book_07_units == 9:
                call home_shea #4
            if book_07_units == 10:
                call home_shea #5
            if book_07_units == 11:
                call im_home
            if book_07_units == 12:
                call home_shea #6
            if book_07_units == 13:
                call im_home
            if book_07_units == 14:
                call home_shea #7
            if book_07_units == 15:
                call home_shea #8
            if book_07_units == 16:
                call im_home
            if book_07_units == 17:
                call home_shea #9
            if book_07_units == 18:
                call im_home
            if book_07_units == 19:
                call im_home
            if book_07_units == 20:
                "ПОПКА"
                call home_shea

        "- Идти к библиотеке (Страница [page_02]) -":
            if book_07_units == 1:
                call at_library
            if book_07_units == 2:
                call at_library
            if book_07_units == 3:
                call at_library
            if book_07_units == 4:
                call home_leena #1
            if book_07_units == 5:
                call at_library
            if book_07_units == 6:
                call home_leena #2
            if book_07_units == 7:
                call home_leena #3
            if book_07_units == 8:
                call home_leena #4
            if book_07_units == 9:
                call at_library
            if book_07_units == 10:
                call home_leena #5
            if book_07_units == 11:
                call at_library
            if book_07_units == 12:
                call home_leena #6
            if book_07_units == 13:
                call home_leena #7
            if book_07_units == 14:
                call at_library
            if book_07_units == 15:
                call at_library
            if book_07_units == 16:
                call home_leena #8
            if book_07_units == 17:
                call at_library
            if book_07_units == 18:
                call home_leena #8
            if book_07_units == 19:
                call at_library
            if book_07_units == 20:
                call home_leena #8
    
    
    
    
    
    return

        
        
### DATES ###
label home_shea:
    if shea == 0: #1
        "\"Глава [book_07_units]\"" "{size=-2}Вы входите в дом и застаете Ши принимающей ванну. Вы пялитесь на ее сиськи, и она вырубает вас своим коронным ударом.{/size}"
    if shea == 1: #2
        "\"Глава [book_07_units]\"" "{size=-2}Дома Ши готовит ужин для вас. Вы бросаете мимолетный взгляд на ее трусики, и она снова вырубает вас свои коронным ударом.{/size}"
    if shea == 2: #3
        "\"Глава [book_07_units]\"" "{size=-2}Вы возвращаетесь домой и обнаруживаете, что никого нет. Вы решаете посмотреть порно в гостиной. За этим вас застает Ши... и вырубает своим коронным ударом.{/size}"        
    if shea == 3: #4
        "\"Глава [book_07_units]\"" "{size=-2}К ночи погода на улице портится. Начинается ливень и гроза. Ши, испугавшись залазит в вашу постель. Ваше мужское достоинство восстает, и Ши и вырубает вас своим коронным ударом.{/size}"
    if shea == 4: #5
        "\"Глава [book_07_units]\"" "{size=-2}Пока все спокойно, вы решаете убраться в комнате Ши. Она не оценила по достоинству ваше вторжение в личное пространство и выдала свой коронный удар, который вас вырубил.{/size}"
    if shea == 5: #6
        "\"Глава [book_07_units]\"" "{size=-2}Дома никого нет. Вы решаете посмотреть порнуху в гостинной и Ши застает вас за этим занятием. Вы ожидаете, что сейчас снова получите, но нет - Ши просто убегает.{/size}"
    if shea == 6: #7
        "\"Глава [book_07_units]\"" "{size=-2}Вечером вы решаете извиниться за свои поступки и идете к Ши. Ши тоже готовится ко сну и одета в ночную рубашку. У вас слегка встает пока вы извиняетесь. Ши принимает ваши извинения краснея.{/size}" 
    if shea == 7: #8
        "\"Глава [book_07_units]\"" "{size=-2}Снова на улице портится погода. Ши опять проскальзывает к вам в кровать. Она целует вас и просит лишить ее анальной девственности. Вы занимаетесь анальным сексом со своей сводной сестренкой.{/size}"
    if shea == 8: #9
        "\"Глава [book_07_units]\"" "{size=-2}Вечером Ши проскальзывает в вашу комнату. Пока родители заканчивают ужинать внизу, вы буравите сладкую попку своей сестренки, а она с упоением вас принимает. {/size}"
    $ shea += 1            
    return

### DATES ###
label home_victoria:
    if victoria == 0: #1
        "\"Глава [book_07_units]\"" "{size=-2}Вы решаете побродить вокруг школы. Мисс Стивенс сидит в одном из классов, и вы решаете тайно за ней понаблюдать.{/size}"
    if victoria == 1: #2
        "\"Глава [book_07_units]\"" "{size=-2}Вы видите, как мисс Стивенс опять работает в пустом классе. На этот раз она замечает вас, и вам приходится срочно придумывать что вы тут делаете. Она дает вам большое домашнее задание.{/size}"
    if victoria == 2: #3
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс обнаруживает вас тусующимся в коридоре. И вы не выполнили задание, которое она вам дала. Она разговаривает с вами презрительно.{/size}"
    if victoria == 3: #4
        "\"Глава [book_07_units]\"" "{size=-2}Вы снова натыкаетесь на мисс Стивенс. Она что, преследует вас? Она дает вам еще одно задание. Вы начинаете ненавидеть эту женщину. {/size}"
    if victoria == 4: #5
        "\"Глава [book_07_units]\"" "{size=-2}Вы пытаетесь избежать мисс Стивенс, но неудачно. Ваше задание не выполнено, и она начинает нудить, что таким плохим ученикам, как вы, одна дорога - в дворники.{/size}"
    if victoria == 5: #6
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс читает вам нотацию и вдруг случайно проливает чай вам на колени. Она пытается промокнуть влагу тряпкой, вы возбуждаетесь, но она делает вид, что ничего не замечает.{/size}" 
    if victoria == 6: #7
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс вновь читает вам нотацию. Внезапно она целует вас в губы, но тут же извиняется и просит помалкивать об этом. Вы возвращаетесь домой в сильном смущении. {/size}" 
    if victoria == 7: #8
        "\"Глава [book_07_units]\"" "{size=-2}Вы решаете побродить у школы, в надежде встретить мисс Стивенс. Но ее нигде нет...{/size}"  
    if victoria == 8: #9
        "\"Глава [book_07_units]\"" "{size=-2}Мисс Стивенс вызывает вас к себе. Она хватает вас за член и начинает его ласкать, но вскоре отпускает вас. Вы ошеломленно бредете домой. {/size}"   
    $ victoria += 1            
    return


### DATES ###
label home_leena:
    if leena == 0: #1
        "\"Глава [book_07_units]\"" "{size=-2}Вы идете в библиотеку. Не считая темноволосой девушки в очках в углу, вы единственный посетитель. Вы проводите время за чтением научной фантастики.{/size}"
    if leena == 1: #2
        "\"Глава [book_07_units]\"" "{size=-2}Вы в библиотеке. Опять эта девушка в очках. Вы читаете свою книгу и замечаете, что девушка время от времени пристально смотрит на вас. Что это с ней? {/size}"
    if leena == 2: #3
        "\"Глава [book_07_units]\"" "{size=-2}Похоже, эта девушка постоянно здесь торчит. Вы впервые рассматриваете ее: длинные темные волосы, очки, отличная фигура. Она довольно милая, вы увлекаетесь рассматриванием, и она ловит ваш взгляд. {/size}"       
    if leena == 3: #4
        "\"Глава [book_07_units]\"" "{size=-2}Та девушка, как обычно, здесь. Она, вероятно, застенчива, вы решаете поговорить с ней, но поначалу она игнорирует вас, а потом просто уходит. Она очень странная.{/size}"    
    if leena == 4: #5
        "\"Глава [book_07_units]\"" "{size=-2}Молчаливой темноволосой девушки сегодня нет. Вы занимаете свое обычное место и находите от нее записку. Она извиняется и признается, что вы ей нравитесь и просит прощения за прошлый раз.{/size}"
    if leena == 5: #6
        "\"Глава [book_07_units]\"" "{size=-2}Вы опять один в библиотеке. Девушки, нет, записки тоже. Вы не можете вспомнить, видели ли вы ее вне билиотеки за исключением одного раза. Кто же эта красотка, черт возьми? {/size}"
    if leena == 6: #7
        "\"Глава [book_07_units]\"" "{size=-2}Вы пытаетесь читать, но не можете сосредоточиться. Внезапно та девушка входит и садится рядом с вами. Вы ждете объяснений, но она притворяется, что просто читает. {/size}"
    if leena == 7: #8
        "\"Глава [book_07_units]\"" "{size=-2}Вы делаете вид, что читаете, пока ждете девушку. Она снова садится рядом и начинает под столом гладить у вас между ног. Да что с ней такое?{/size}"
    if leena == 8: #9
        "\"Глава [book_07_units]\"" "{size=-2}Как только вы появляетесь, девушка сразу тащит вас за книжные полки и просит трахнуть её. Вы подчиняетесь, трахаете и кончаете в нее. Она возращается на свое место, а вы остаетесь за полками в полной растерянности.{/size}"   
    $ leena += 1            
    return
        
        
        
        
        
        

### HOME ###
label im_home:
$ random_home = renpy.random.randint(1, 5)      
if random_home == 1:
    "\"Глава [book_07_units]\"" "{size=-2}Вы вернулись домой. Дом пуст. Вы решили поиграть в видеоигры до вечера.{/size}"
if random_home == 2:
    "\"Глава [book_07_units]\"" "{size=-2}}Вы вернулись домой. Дом пуст. Вы решили посмотреть порно в гостинной.{/size}"
if random_home == 3:
    "\"Глава [book_07_units]\"" "{size=-2}Вы пришли домой. Ваш отец сегодня вернулся рано. Вы решаете пойти пробежаться, пока он не начал доставать вопросами когда, наконец, вы возьметесь за ум.{/size}"
if random_home == 4:
    "\"Глава [book_07_units]\"" "{size=-2}Вы пришли домой. Ваша мачеха сегодня вернулась рано. Вы слушаете её бесконечную болтовню о какой-то ерунде и не понимаете почему отец решил на ней жениться.{/size}"
if random_home == 5:
    "\"Глава [book_07_units]\"" "{size=-2}Вы вернулись домой. Никого нет. Вы решили воспользоваться моментом и вздремнуть.{/size}"
return
    

### SCHOOL ###
label at_school:
    $ random_home = renpy.random.randint(1, 5)      
    if random_home == 1:
        "\"Глава [book_07_units]\"" "{size=-2}Вы идете на школьный стадион и расслабляетесь на трибунах, наблюдая за тренировками черлидерш...{/size}"
    if random_home == 2:
        "\"Глава [book_07_units]\"" "{size=-2}Вы прокрадываетесь в свое тайное место на школьной крыше и смотрите на надвигающиеся тяжелые тучи, надеясь что вечером пойдет дождь ..{/size}"
    if random_home == 3:
        "\"Глава [book_07_units]\"" "{size=-2}Вы бродите по пустым коридорам школы и сталкиваетесь с уборщиком. Он подозрительно смотрит на вас и уходит по своим делам. Вы отправляетесь домой.{/size}" 
    if random_home == 4:
        "\"Глава [book_07_units]\"" "{size=-2}Вы покупаете плитку шоколада, а затем проникаете в один из пустых классов, чтобы почитать свою любимую фантастическую книгу.{/size}" 
    if random_home == 5:
        "\"Глава [book_07_units]\"" "{size=-2}Вы бродите по пустым школьным коридорам некоторое время. Начинается дождь. Ваша сводная сестра Ши боится грома и вы надеетесь, что ночью будет шторм.{/size}"                               
return 

### LIBRARY ###
label at_library:
    $ random_home = renpy.random.randint(1, 5)      
    if random_home == 1:
        "\"Глава [book_07_units]\"" "{size=-2}Вы идете к школьной библиотеке и обнаруживаете у дверей мужчину в черном костюме. Вы опасаетесь, что он вас не пропустит, но он игнорирует вас.{/size}"
    if random_home == 2:
        "\"Глава [book_07_units]\"" "{size=-2}Вы проводите остаток дня в библиотеке. Вы читали фантастику, вздремнули, купили конфет из автомата, а затем почитали еще немного. Жизнь прекрасна!{/size}" 
    if random_home == 3:
        "\"Глава [book_07_units]\"" "{size=-2}Вы бродите мимо древних на вид книжных полок, надеясь найти давно забытые книги заклинаний или что-то в этом роде. Но вскоре вам становится скучно, и вы уходите домой.{/size}"
    if random_home == 4:
        "\"Глава [book_07_units]\"" "{size=-2}Библиотека пуста, так что вы прячетесь за книжными полками и дрочите, представляя как мисс Стивенс читает вам нотации в одном нижнем белье.{/size}"
    if random_home == 5:
        "\"Глава [book_07_units]\"" "{size=-2}Вы слышите голоса и прячетесь за книжной полкой. Оттуда вы видите чирлидершу, которая лижется сразу с двумя качками. Вы решаете свалить от греха.{/size}"
    return


### Эпилог
label epilogue:
    "\"Эпилог\"" "{size=-2}Прошел год. Вы поступили в университет за рубежом. Вам нравится учиться и вы редко думаете о прошлом и возлагаете большие надежды на будущее.{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 01 из 05-{/size}"
    return
        
        
### HAREM ###        
        
        
        
        
        
        
        
        
        
        
