################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label daphne_pre_01: #LV.1 (Whoring = 0 - 2)

    $snape.State(pos2=gMakePos( 340, 420 )).Visibility("head", transition=None)
    $hero("Послушай, Северус. Ты уже давно обещал прислать мне парочку слизеринских шлюх.")
    $snape("~29// Гхм...")
    $hero("Что значит твое «гхм»?... Я точно знаю, у тебя есть шлюхи!// Ты сам мне недавно хвалился, что делаешь что угодно с кем захочешь.")
    $snape("~03// Понимаешь, мой друг, все не так просто.//~04// Эти девки... Они уверены, что ты,... то есть, директор, не в курсе наших маленьких шалостей.")
    $hero("И?")
    $snape("~03// И если окажется, что директору тоже не чуждо стремление к потас...\n к прекрасному, то это разрушит все их мировоззрение...")
    $hero("Послушай, дружище. Мне нет дела до мировоззрения шлюх, в них меня интересуют совсем другие детали.") 
    $snape("~06// Да, но если они узнают о твоем интересе, они могут не захотеть больше этого делать.//~16// #(Надеюсь он проглотит эту хрень)//"
        "~29// #На самом деле я не собираюсь присылать ему шлюх -//"
        " #Он же, мать его, джинн, обладающий крутой космической силой и все такое!//~26// #Кто знает насколько он хорош в ЭТОМ.")
    $hero("Ты думаешь, я проглочу эту хрень?")
    $snape("~05//Хрень?//~04// Мой друг! Я о тебе забочусь! Они реально могут перестать давать!")
    $hero("Давать кому, дружище?// Не тебе ли?// Я думаю, тебе просто нравится быть единственным петухом в курятнике.//"
        "Я тут не досыпаю ночей, тружусь, чтобы выдрессировать тебе девчонку,...// а ты катаешься, как сыр в масле и не хочешь помочь мне с маленьким развлечением.")
    $snape("~01// Да что тебя не устраивает?!// ~02//Я слышал у вас очень хорошо продвигается с мисс Грейнджер.")
    $hero("Ты хочешь поменяться? Я готов уступить тебе воспитание этой девчонки всего за пару шлюх.") 
    $snape("~29// Эм...")
    $hero("Я тебя предупреждаю, Северус, если ты будешь и дальше утаивать от меня девок,...// директор может перестать скрываться в башне и выйдет сам на поиски!")
    $snape("~01// Но ты не можешь!..")
    $hero("Продолжай в том же духе и увидишь могу я или нет...")
    $snape("~06//......")
    $hero("......")
    $snape("~02//............")
    $hero("............")
    $snape("~23// Ладно-ладно...// Ты меня убедил. Я пришлю тебе шлюху.")
    $hero("Двух шлюх, Северус.")
    $snape("~28// Я уверен, ЭТА тебе заменит двух сразу.")
    $hero("Смотри, если это окажется какая-то уродка...")
    $snape("~01// За кого ты меня принимаешь!// Чистая кровь в Мерлин знает каком поколении, была на обложке \"Ведьмополитен\"...//"
        "~02// #(стоит крайняя в пятом ряду)// ~01// ...чирлидерша, слизеринка, наконец!//"
        "~23// Девица - пальчики оближешь!")
    $hero("Ну, это ее забота... облизывать...// Так в чем подвох?")
    $snape("~05// Подвох?")
    $hero("Ты слишком быстро согласился. Вот я и спрашиваю: в чем подвох? ")
    $snape("~23// Никакого подвоха, мой друг!// ~02//Ты сам убедишься. Потерпи пару дней. Всего пару дней!")
    $snape.Visibility()
    "> Вы решаете довериться Снейпу и подождать два дня."
    "> Остаток вечера вы слушаете стенания Северуса\n о нелегкой доле преподавателя и\n фантазируете об обещанной шлюхе."

    $event.Finalize()
    jump day_start


label daphne_pre_02: #LV.1 (Whoring = 0 - 2)
    $ renpy.play('sounds/knocking.mp3') #Sound someone knocking on the door.
    "*Тук-тук-тук!*"
    $daphne.Visibility()
    menu:
        "\"Кто это?\"":
            $daphne(who, "Сэр, меня прислал профессор Снейп...")
            $hero("#(Превосходно! Шлюха прибыла!)// #(Надеюсь, не слишком страшна на вид. Впрочем, после стольких дней воздержания я не очень переборчив.)")
        "\"Да, входи...\"":
            pass

    skaz "Жаль прерываться на самом интересном месте? "
    skaz "Нам тоже. Но данная сюжетная линия пока дописана только до этой точки..."
    skaz "(впрочем, вам доступны другие сюжетные линии)."
    skaz "Оставьте ваши вопросы, благодарности и пожелания на нашем {a=http://wtrus.ixbb.ru/viewtopic.php?id=9}ФОРУМЕ{/a}. \nТак вы простимулируете нас и продолжение появится быстрее. :)"
    $event.Finalize()
    return
#    jump day_start
