################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label daphne_pre_01: #Снейп обещает, что пришлет шлюху

    $snape.State(pos2=gMakePos( 340, 420 )).Visibility("head", transition=None)
    $hero("Послушай, Северус. Ты уже давно обещал прислать мне парочку слизеринских шлюх.")
    $snape("~29// Гхм...")
    $hero("Что значит твое «гхм»?... Я точно знаю, у тебя есть шлюхи!// Ты сам мне недавно хвалился, что делаешь что угодно с кем захочешь.")
    $snape("~03// Понимаешь, мой друг, все не так просто.//~04// Эти девки... Они уверены, что ты,... то есть, директор, не в курсе наших маленьких шалостей.")
    $hero("И?")
    $snape("~03// И если окажется, что директору тоже не чуждо стремление к потас...\n к прекрасному, то это разрушит все их мировоззрение...")
    $hero("Послушай, дружище. Мне нет дела до мировоззрения шлюх, в них меня интересуют совсем другие детали.") 
    $snape("~06// Да, но если они узнают о твоем интересе, они могут не захотеть больше этого делать.//~16// #(Надеюсь он проглотит эту хрень)//"
        "~29// #На самом деле я не собираюсь присылать ему шлюх -//"
        " #Он же, мать его, джинн, обладающий крутой космической силой и все такое!//~26// #Кто знает насколько он хорош в ЭТОМ.")
    $hero("Ты думаешь, я проглочу эту хрень?")
    $snape("~05//Хрень?//~04// Мой друг! Я о тебе забочусь! Они реально могут перестать давать!")
    $hero("Давать кому, дружище?// Не тебе ли?// Я думаю, тебе просто нравится быть единственным петухом в курятнике.//"
        "Я тут не досыпаю ночей, тружусь, чтобы выдрессировать тебе девчонку,...// а ты катаешься, как сыр в масле и не хочешь помочь мне с маленьким развлечением.")
    $snape("~01// Да что тебя не устраивает?!// ~02//Я слышал у вас очень хорошо продвигается с мисс Грейнджер.")
    $hero("Ты хочешь поменяться? Я готов уступить тебе воспитание этой девчонки всего за пару шлюх.") 
    $snape("~29// Эм...")
    $hero("Я тебя предупреждаю, Северус, если ты будешь и дальше утаивать от меня девок,...// директор может перестать скрываться в башне и выйдет сам на поиски!")
    $snape("~01// Но ты не можешь!..")
    $hero("Продолжай в том же духе и увидишь могу я или нет...")
    $snape("~06//......")
    $hero("......")
    $snape("~02//............")
    $hero("............")
    $snape("~23// Ладно-ладно...// Ты меня убедил. Я пришлю тебе шлюху.")
    $hero("Двух шлюх, Северус.")
    $snape("~28// Я уверен, ЭТА тебе заменит двух сразу.")
    $hero("Смотри, если это окажется какая-то уродка...")
    $snape("~01// За кого ты меня принимаешь!// Чистая кровь в Мерлин знает каком поколении, была на обложке \"Ведьмополитен\"...//"
        "~02// #(стоит крайняя в пятом ряду)// ~01// ...чирлидерша, слизеринка, наконец!//"
        "~23// Девица - пальчики оближешь!")
    $hero("Ну, это ее забота... облизывать...// Так в чем подвох?")
    $snape("~05// Подвох?")
    $hero("Ты слишком быстро согласился. Вот я и спрашиваю: в чем подвох? ")
    $snape("~23// Никакого подвоха, мой друг!// ~02//Ты сам убедишься. Потерпи пару дней. Всего пару дней!")
    $snape.Visibility()
    "> Вы решаете довериться Снейпу и подождать два дня."
    "> Остаток вечера вы слушаете стенания Северуса\n о нелегкой доле преподавателя и\n фантазируете об обещанной шлюхе."

    $event.Finalize("day_start")
#    jump day_start


label daphne_pre_02: #LV.1 (Whoring = 0 - 2)
    $ renpy.play('sounds/knocking.mp3') #Sound someone knocking on the door.
    "*Тук-тук-тук!*"
    $daphne.Visibility()
    menu:
        "\"Кто это?\"":
            $daphne(who, "Сэр, меня прислал профессор Снейп...")
            $hero("#(Превосходно! Шлюха прибыла!)// #(Надеюсь, она ничего. Впрочем, после стольких дней воздержания я не очень переборчив.)// Да, входи!")
        "\"Да, входи...\"":
            pass

#    skaz "Жаль прерываться на самом интересном месте? "
#    skaz "Нам тоже. Но данная сюжетная линия пока дописана только до этой точки..."
#    skaz "(впрочем, вам доступны другие сюжетные линии)."
#    skaz "Оставьте ваши вопросы, благодарности и пожелания на нашем {a=http://wtrus.ixbb.ru/viewtopic.php?id=9}ФОРУМЕ{/a}. \nТак вы простимулируете нас и продолжение появится быстрее. :)"
    $daphne.LoadDefItemSets()

    $daphne.chibi.State("door", speed="go").Trans(d4, "blink").Trans("go center", "blink") # Если делать dissolve в движении, то сбивается счетчик времени. Лучше выполнить появление чибика стоя, затем уже двигать его 
    pause.5
    $screens.ShowD3("bld1")



    $daphne.State(pos="door").Visibility("body+")("~55 00 1 smi// Добрый день, профессор Дамблдор.") 
#    $hermi.Visibility("body+")(".....")

    $screens.Show("ctc").Pause().Hide("ctc")

    $hero  (m, "#(О-о, вот это шлюшка! Обожаю длинноногих блондинок!...)",g9,"#(...а также брюнеток, шатенок и рыжих. Я могу кончить от одного их вида!)",m," #(Вот только сиськи маловаты. Может, их подрастить заклинанием?..)", 
        g4, "#(Нет, джинни, умерь свои фантазии. Вспомни, что случилось, когда ты растил сиськи принцессе... мда)", 
        m, "Здравствуйте, мисс э-э... \n#(Великие пески, почему он не сказал как ее зовут?).") 
    $daphne("~55 00 1 def// Профессор Снейп сообщил, что вы хотели меня видеть.") 
    $hero  ("Эм, да. Несомненно хотел... видеть.// Но, он же сказал, зачем он тебя прислал?") 
    $daphne("~55 00 1 smi", "Нет, сэр. Он не сказал.") 
    $hero  ("#(Думаю, нужно с ней немного поболтать. Просто для разогрева.)") 

    menu: 
        "Поговорить насчет учебы": 
            $hero  ("Что ж, мисс, я хотел поговорить насчет вашей учебы.") 
            $daphne("Учеба не то, что меня волнует, сэр.// ~46 n0 1 def// Меня гораздо больше волнует, почему в Хогвартсе обучается грязнокровое мугродье.//" 
                "Вы же чистокровный волшебник, сэр?") 
            $hero  (g4, "Кто? Я?.. А, ну да. Вроде того.") 
            $daphne("~55 00 1 pur",  "Хм. Вы по делу смущаетесь.// По древности рода с Гринграссами никто не сравнится, так что вы и должны чувствовать себя неловко.") 
            $hero  (m,"(Гринграссы? Что это еще за хрень?)") 
            $daphne("~46 00 1 pur",  "Но как бы то ни было, сэр. Вы должны были проследить, чтобы  мугродье не чувствовало себя здесь вольготно.", 
                "А вы вместо этого каждый год принимаете новых.// ~46 03 1 smi// И чистокровные девочки должны испытывать сложности.") 
            $hero  ("Чистокровные девочки?") 
            $daphne("~46 n0 1 pur",  "Да, сэр! Почему эту грязнокровку называют лучшей на курсе?//"
                "Почему мугродью разрешается дышать одним воздухом с истинными волшебниками?//" 
                "~64 n0 1 pur// Я могу еще быть рядом со всякими Малфоями или Паркинсон.//" 
                "Семейки так себе, второй сорт. Но какие-никакие чистокровки, а эта девица!!!") 
        "Поговорить насчет факультета": 
            $hero  ("Что ж, мисс, я хотел поговорить об обстановке на факультете.") 
            $daphne("~46 n0 1 def",  "Обстановка на факультете, сэр? Она отвратительна!// Грязнокровое мугродье заполонило Хогвартс.") 
            $hero  ("#(Что это за?..)") 
            $daphne("~55 n0 1 ope",  "И вы делаете вид, что этого не замечаете. Хотя ваш отец...// Вот он был истинным чистокровным волшебником и не побоялся прикончить троих маглов. За что его и упрятали в Азкабан.") 
            $hero  ("Правда, что ли? #(Ну и висельники в родстве с местным директором)") 
            $daphne("~55 00 1 dis",  "Не притворяйтесь, что вы этого не помните, сэр!// А если позабыли, это не делает вам чести!", 
                "~55 00 1 pou// Гринграссы всегда стояли за чистоту крови и когда видишь волшебника, который предает наши идеалы...") 

    $hero  ("#(Хм, какая экспрессия! Интересно, трахается она так же энергично?)// Постойте, мисс, это все очень увлекательно, но, может, уже завершим прелюдию и приступим?") 
    $daphne("~64 00 1 smi// Приступим к чему, сэр?") 
    $hero  ("Ну, к этому самому... чпоки-чпоки, тити-мити, а?") 
    $daphne("~64 w0 1 pur",  "\"Чпоки-чпоки\", сэр?") 
    $hero  ("Ну я не знаю, как это у вас, девушек, называется.// В общем, то, что вы постоянно делаете с профессором и зачем он вас сюда прислал.") 
    $daphne("~64 w0 1 pou// Я не понимаю, сэр.") 
    $hero  ("О, великие пески пустыни!// #(Она небыстро шевелит мозгами. Надеюсь, что бедрами шевелит быстрее.)//" 
        "Я говорю, заняться тем, чем обычно занимаются шлю... девчонки вроде вас.") 
    $daphne("~55 n0 1 dis// На что это вы намекаете?!") 
    $hero  ("Я намекаю? Да я прямо говорю!...") 
    $daphne("~55 n0 1 ang",  "Если вы смеете намекать на то, чем занимаются некоторые особы с преподавателями, то это омерзительно!") 
    $hero  ("#(Э-э, Снейп, это что, шутка?)") 
    $daphne("~55 n0 1 ope",  "Я сегодня же пошлю сову родителям и сообщу о грязных предложениях, которые вы мне тут делаете.", 
        "А уж они донесут об этом в министерство, будьте уверены.") 
    $hero  (g4, "#(Не могу поверить!... Чертов Снейп!!!)// Эм, постойте, мисс, вы неправильно поняли!") 
    $daphne("~46 n0 1 ope// Я все правильно поняла! Вам недолго осталось сидеть в этом кресле!") 

    $screens.HideD3("bld1")
    $daphne.Visibility(transition=d3).chibi.Trans("goout door").Hide(d3)    
    $ renpy.play('sounds/door.mp3') #Sound of a door opening.
    pause.5

    $hero("...................................")

    return event.Finalize()

label daphne_pre_03: #Разборки со Снейпом после того, как шлюха оказалась не шлюхой

    $screens.Hide("snape_main")#.Pause(0.3)

    if not daytime:
        $hero(m, "Как тебе выпивка, дружище? Хорошо сидишь, удобно?// Тогда скажи...")
    $hero(g1, "Что это было?!.. Отвечай мне, во имя гребаных песков пустыни!")

    $snape.State("doorleft")("~01").Visibility("body" if daytime else "head")

    $snape("~05// Ты о чем, мой друг?")
    $hero("Не прикидывайся овечкой! Я просил у тебя шлюху, мать твою, а ты мне кого прислал?")
    $snape("~03// Ну, технически она шлюха.")
    $hero(m, "Что это вообще значит «технически она шлюха»?")
    $snape("~13// Ну, у нее есть все необходимое для шлюхи. Все нужные хм, детали. И какая экспрессия!")
    $hero("Да уж, экспрессию было трудно не заметить.")
    $snape("~20// Я бы ее с удовольствием разложил на полу.")
    $hero("Я бы тоже ее с удовольствием...",g4," Постой, так ты сам ни разу ее не трахнул?!")
    $snape("~02// За кого ты меня принимаешь, мой друг? Разве стал бы я предлагать тебе пользованный товар?// Чистокровная...")
    $hero(g4, "Про чистокровную я уже наслушался, твою мать!")
    $snape("~23// Чистокровная нетронутая юная волшебница, которая только и ждет, чтобы кто-нибудь ее объездил.")
    $hero(m,"И ты решил, что я лучше всех подхожу на эту роль.")
    $snape("~02// Ну, у тебя неплохо получается с Гермионой Грейнджер. Я был уверен, что ты не спасуешь и перед Дафной Гринграсс.")
    $hero("Если бы ты, дружище, хотя бы предупредил меня, я бы может что-то и придумал.//"
        " Но теперь эта юная сука настучит родителям и министерская проверка – самое меньшее, что нас ждет.//"
        "Предупреждаю, если меня вынесут из этого кабинета, то тебя вынесут следом #(если я не найду способа смыться раньше)")
    $snape("~06// Не все так трагично, мой друг. Я поговорил с мисс Гринграсс, и она готова не сообщать ничего родителям.// Пока.")
    $hero("Слово «пока» особенно обнадеживает, гребаные пески.//"
        "Я не спрашиваю как тебе это удалось. И все же, прости мое любопытство,...//"
        "...если ты так замечательно ладишь с этой сучкой,...// почему ты до сих пор ее не трахнул?!")
    $snape("~29// Мой друг. Одно дело убедить заносчивую дрянь в том, что шум вокруг такого деликатного предмета, как ее невинность, не в ее интересах.//"
        "И совсем другое - залезть к ней в трусики.// ~23// Я хочу предоставить эту честь тебе.")
    $hero("Не собираюсь я с ней больше встречаться!")
    $snape("~29// Боюсь, у тебя нет выбора.")
    $hero("Та-ак...// Чего я еще не знаю?")
    $snape("~10// Не хочу на тебя давить, мой друг.// Поэтому просто пусть события идут своим чередом. Может все и обойдется.//"
        "Но на твоем месте я бы уже начал задумываться как расположить к себе очаровательную девушку древнего и благородного рода.//"
        "~03// А теперь извини, мне пора идти.")

    $screens.Hide("snape_02", "bld1", d3 )
    $snape.Visibility(transition=d3)
    $ renpy.play('sounds/door.mp3') #Sound of a door opening.

    $event.Finalize("night_start" if daytime else "day_start")



label daphne_pre_05: #Разборки со Снейпом после письма от родителей Дафны, само письмо лежит в 15_mail:daphne_pre_04

    $screens.Hide("snape_main")#.Pause(0.3)

    if not daytime:
        $hero(m, "Не ожидал я от тебя, дружище...")
    $hero(m, "Ты меня подставил")

    $snape.State("doorleft")("~01").Visibility("body" if daytime else "head")

    $snape("~05// Успокойся, мой друг, успокойся. Это было единственно возможным решением.")
    $hero("Да неужели?")
    $snape("~03// Конечно. Эти Гринграссы, эти снобы... Они были уже готовы забрать девчонку из Хогвартса.")
    $hero("Ну и пусть бы катилась.")
    $snape("~13// Ты подумай, какова вероятность, что она наплетет про тебя что было и чего не было, как только за ней закроется дверь.// И как они взбесятся. А уж связи у них. О-о... об этом можно книгу написать.// А пока она здесь...")
    $hero("Вот именно, она здесь и может видеть меня каждый день. А это не способствует забыванию.")
    $snape("~20// Кажется, ты потерял хватку, мой друг.// Важно не то, что она МОЖЕТ тебя видеть, а то, что она ОБЯЗАНА приходить к тебе, поскольку ей велели предки.// Улавливаешь открывающиеся возможности?//"
        "До каникул она в полном твоем распоряжении, тебе дан «еще один шанс».// И я верю, что ты воспользуешься этим шансом на все 100%%.")
    $hero("Ты - чертов лицемер!// Я должен пыхтеть выдумывать, как обломать сразу двух девчонок, а ты в это время будешь развлекаться со шлюхами.")
    $snape("~02// Ну, у каждого своя судьба, мой друг.")
    $hero(g4, "Ах, ты!..")
    $snape("~23// Мой друг, я ведь не отказываюсь помочь тебе. Если тебе что-то нужно...")
    $hero(m,"Да, мне что-то нужно. Выкладывай о ней все, что ты знаешь!")
    $snape("~02// Это так скучно. Давай я лучше пришлю тебе сову с выписками из ее студенческого личного дела с моими пометками.// Я их делал, когда всерьез планировал завалить ее.//"
        "И еще, думаю, тебе нужно почитать умных книжек, чтобы поучиться обращаться с девицами такого рода.// Опять же, есть специальное зелье...")
    $hero("Зелье?! А вот с этого момента поподробнее...")
    $snape("~06// Все в умных книгах дружище, все в них.")

    if not daytime:
        $snape("Давай не будем портить такой замечательный момент и просто выпьем.")
        "> Вы пытаетесь вытянуть из Снейпа, что-то еще, но он только хлещет спиртное стаканами - похоже, студенты его серьезно достали."
        "> В конце концов он начинает кричать, что все, что ему нужно это сигареты и алкоголь. Вы с трудом его утихомириваете и отправляете спать."


    $screens.Hide("snape_02", "bld1", d3 )
    $snape.Visibility(transition=d3)
    $ renpy.play('sounds/door.mp3') #Sound of a door opening.

    $event.Finalize("night_start" if daytime else "day_start")


label daphne_pre_07: #Разговор с Гермионой о Дафне. В зависимости от ветки и развращенности реакция. 
# После того, как будет получена информация о выпивке Дафны ивент заканчивается. А так с интервалом в 2 дня при попытке поговорить возобновляется.
    
    $hermi.Visibility("body+")
    $hero  (m, "Я хотел бы поговорить с тобой о некоторых девушках с твоего факультета.//")
    if not event.IsExec( 1, "start1"): # Если не прошел день с начала самого первого старта, т.е. это и есть первый старт
        $hermi("~body_04.png// О каких девушках?") 
        $hero  ("Да о всяких разных.") 
        $hermi("~body_04.png// Я не понимаю сэр. На факультете много девушек.") 
        $hero  ("Да взять хотя бы первую, которая попадется. Кто у нас там первый...") 
        $hermi("~body_04.png// По алфавиту, сэр? Алисия.") 
        $hero  ("Причем здесь алфавит, великие пески! Первая это...")
        $hermi("О, сэр! Я поняла. Вы хотите поговорить обо мне, ведь я первая по успеваемости. Это...это так трогательно...") 
        $hero("Да нет же, нет! Это - Дафна Гринграсс.") 
        $hermi("~body_04.png// Я не понимаю, сэр. Почему она первая?") 
    else:
        $hermi("~body_04.png// Опять хотите выведать о Дафне?")

    $hero("Неважно, просто расскажи мне о ней.") 
    $hermi("~body_04.png// Хм...// Мне неприятно о ней говорить. Она все время кичится тем, что чистокровная.")
    $hero("Еще какие-нибудь сведения?") 
    $hermi("~body_04.png// Какого рода, сэр?")
    $hero("Ну может быть какие-нибудь... как бы получше выразиться... грешки?") 
    $hermi("~body_04.png// Сэр! Как вы можете требовать от меня рассказать такое про другую студентку! Это недостойно!")

    if hermi.whoring<12:
        $hermi("~body_04.png// Я немедленно ухожу!")
        $hermi.liking-=30
    else:
        $hero("Мисс Грейнджер, постойте. Примите во внимание, что Дафна - слизеринка, и предоставляя эту информацию, вы помогаете Гриффиндору.//"
            "Тем более, если у нее нет грешков, то вы ничего такого не сможете рассказать. А если есть - уж наверное она должна понести наказание.") 
        $hermi("~body_04.png// Все равно, сэр, это как-то...")
        if end.IsEnding(const_ENDING_STRONG_GIRL):
            $hermi("~body_04.png// Все это напоминает методы ми-6, сэр, как показыват в сериалах. Вы случайно не работаете на спецслужбы?") 
            $hero  ("Очень смешно!") 
            $hermi("~body_04.png// Тогда посмейтесь, сэр. А я отправлю сову мистеру и миссис Гринрасс, с письмом о том, что вы выведывали непристойную информацию об их дочери.") 
            $hero  (m, "Постой! Кто говорит \"непристойную\"? Я не произносил этого слова!") 
            $hermi("~body_04.png// Вы не произносили, сэр. А я - произнесу.") 
            $hero  (m, "Во имя гребаных песков! Хорошо, я знаю к чему ты клонишь. Ты хочешь еще очков?") 
            $hermi("~body_04.png// Десять очков, сэр...") 
            $hero  (m, "Ха! Всего-то? Стоило огород городить.") 
            $hermi("~body_04.png// За каждое ее посещение.") 
            $hero  (m, "Что? За каждое?... А если она... эмм...") 
            $hermi("~body_04.png// Если она так и не даст, сэр? Ну это уже не мои проблемы, правда? И еще 10%% со всех ваших доходов.") 
            $hero  ("Великие пески! Зачем тебе деньги, девочка? Ты и так тут на полном пансионе!") 
            $hermi("У меня ведь могут быть свои маленькие девичьи желания, правда?") 
            $hero  (m, "Мисс Грейнджер, в последнее время вы ведете себя...") 
            $hermi("~body_04.png// Вас что-то не устраивает в этом соглашении, сэр?")
            $hero  (m, "#Вот ведь мелкая шантажистка!") 
            $hermi("~body_04.png// Сэр?")

            menu: 
                "\".....Согласен!\"":
                    $daphne.SetValue("incomePercent",10)
                    $daphne.SetValue("pointsPerDaphneVisit",10)
                    $hero  ("В общем-то,.... устраивает. Хорошо, мисс Грейнджер, теперь рассказывайте.")
                    jump daphne_pre_06_OK

                "\"Подите прочь, мисс, с такими соглашениями!\"":
                    jump daphne_pre_06_Cancel

        else:
            $hermi("~body_04.png// Сэр, она вам нравится, да?")
            $hero("Не пори чушь, мне просто нужна информация.") 
            $hermi("~body_04.png// Я поражена, что вы обратили внимание на эту... на эту суку, сэр.//"
                " Она ходит, задрав нос и не замечает никого, потому что ни у кого нет достаточно чистой крови.//"
                "Странно, что она стала чирлидершей. Это же так низменно полуодетой отплясывать перед толпой полукровок и грязнокровок.")
            $hero("Что еще?") 
            $hermi("~body_04.png// Все-таки она вам нравится… Вы хотите познакомиться с ней поближе, сэр?")
            $hero("Что? Что ты несешь?!") 
            $hermi("~body_04.png// Я просто говорю то, что у вас на уме!//"
                "Это отвратительно, сэр, что вы хотите кое-чем заняться со своей студенткой. И где?! В этом самом кабинете, где...//")
            $hero("#...где все директора обычно и пялят студенток.") 
            $hermi("~body_04.png// Вы что-то сказали, сэр?")
            $hero("Не обращайте внимания. Но я ведь занимаюсь здесь кое-чем с вами, мисс Грейнджер. Это тоже отвратительно?") 
            $hermi("~body_04.png// Да, отвратительно, не думайте, что мне нравится!// Но это можно оправдать, это делается для блага гордого Гриффиндора!//"
                "А тут вы просто хотите кончить в эту... в эту! В эту!!!...") 
            if hermi.liking>0:
                $hero("Мисс Грейнджер, но вы ведь знаете, что я отличаю вас среди прочих студентов.")
                $hermi("Я... я думаю это так, сэр. Но после того, что здесь происходит, как я могу вам доверять?") 
                $hero("Что вы имеете в виду, мисс?")
                $hermi("Вы знаете, сэр. Все эти лапания... и все остальное.") 
                $hero("Мисс Грейнджер...")
                $hermi("Довольно, сэр. Я расскажу вам то, что вы хотите знать. Чтобы вы понимали, какая это дрянная девка.//"
                    "Конечно, это ни на секунду вас не остановит. Но у меня есть условие!") 
                $hero("................?")
                $hermi("Эта девица не должна появляться здесь чаще, чем раз в два дня!")
                menu: 
                    "\"Будь по-твоему...\"":
                        label daphne_pre_06_OK:
                        $daphne.SetValue("visitInterval",2)

                        $hermi("Ну, то, что ваша любовь первостатейная стерва я уже говорила.")
                        $hero  ("Мисс, Грейнджер! Она не моя любовь.")
                        $hermi("Хорошо, пусть будет \"подстилка\".")
                        $hero  ("Она не...")
                        $hermi("Ладно, пока не подстилка. Скоро ею станет.")
                        $hero  ("Мисс! Вы забываетесь! Еще одно слово...")
                        $hermi("Как будет угодно, сэр. Так вот, эта... девушка не имеет друзей кроме Коровы.")
                        $hero  ("Какой коровы, мисс?")
                        $hermi("Простите, сэр, это я о Пэнси Паркинсон. Да и ту подругой можно назвать с натяжкой - недостаточно чистокровна для нее.//"
                            "Парня нет. В свободное время бродит по коридорам с задумчивым видом.//"
                            "Любимые разговоры о чистоте крови - всех уже тошнит от них, даже слизеринцев - не поверите.//"
                            "На прошлом Осеннем балу ужралась как свинья, простите за грубость сэр, но сравнение весьма точное.//"
                            "Хотя утверждала, что почти не брала в рот.//"
                            "Насчет взятия в рот я не осведомлена.")
                        $hero  ("Мисс Грейнджер! Вы становитесь несносны! Вы что, ревнуете?")
                        $hermi("Ревную? К кому, сэр? К ЭТОЙ?// Какие глупости... Я просто рассказывааю вам, как все обстоит на самом деле, ничего не приукрашивая.")
                        $hermi("Позволите продолжить?..// Очень любит когда ее хвалят. Особенно внешность.// И это при том, что сиськи можно найти только с лупой...//")
                        $hero  ("Гермиона Грейнджер!")
                        $hermi("Сэр, вы напрасно возмущаетесь, это правда, я могла наблюдать их в душе вот как вас сейчас!")
                        $hero  ("Без лупы нашли, мисс?")
                        $hermi("Мне очень повезло, сэр, удачно падал свет.//"
                            "Что еще...// Очень боится уронить свою честь//"
                            "Может, где-нибудь уже и уронила, но детали мне неизвестны.")
                        $hero  ("Мисс!")
                        $hermi("Еще боится своей мамочки, а та боится, что о ней скажут люди - другие чистокровки.//"
                            "Все прочие не люди - их мнением не интересуется. Семейка не выписывает \"Ежедневный пророк\" - эта газета недостаточно аристократична.//"
                            "Вместо этого читают \"Чистокровные вести\" где пишут о балах, раутах и меряются длиной генеалогического дерева.//"
                            "Пожалуй, что и все, сэр...//"
                            "А! Еще ее сова Глатен - обжора еще та, только и ищет что бы слопать, не знаю интересно ли вам это...")
                        $hero  ("Хм... Спасибо, мисс Грейнджер.")
                        $hermi("Надеюсь, вы получили, что хотели, сэр. А теперь мне пора идти.")
                        $event.Finalize()

                    "\"Так не пойдет!\"":
                        label daphne_pre_06_Cancel:
                        $hermi("Как угодно. В таком случае, сэр, мой ответ - нет!// Мне нужно идти...")
                        $hermi.liking-=30
            else:
                $hermi("Даже не надейтесь, что я буду вам помогать, сэр!..// Мне пора!")
                $hermi.liking-=30
    $hermi.Visibility()
    jump hermione_goout



label daphne_pre_finish: #LV.1 (Whoring = 0 - 2)
    $ renpy.play('sounds/knocking.mp3') #Sound someone knocking on the door.
    "*Тук-тук-тук!*"
    $daphne.Visibility()
    menu:
        "\"Кто это?\"":
            $daphne("Это... Это Дафна Гринграсс, сэр. Могу я войти?")
            $hero("Да, входи!")
        "\"Да, входи...\"":
            pass

    
    $daphne.chibi.State("door", speed="go").Trans(d4, "blink").Trans("go center", "blink") # Если делать dissolve в движении, то сбивается счетчик времени. Лучше выполнить появление чибика стоя, затем уже двигать его 
    pause.5
    $screens.ShowD3("bld1")

    $daphne.State(pos="door").Visibility("body+")("~55 00 1 smi// Добрый день, профессор Дамблдор.") 

#    label daphne_pre_finish_menu:
    if event._finishCount==0: # Первый раз
        $daphne("~55 00 1 def// Родители прислали мне сову, что вы будете со мной заниматься.// Чтобы я заняла соответствующую позицию в Хогвартсе.") 
        $hero  (m, "#Да, мелкая дрянь, ты у  меня будешь занимать самые разные позиции.") 
        $daphne("~55 00 1 def// Откровенно говоря, я не в восторге от этой идеи...// ...// Сэр?...") 
        $hero  ("Откровенно говоря, я тоже, мисс.") 
        $daphne("~55 00 1 def// Что?!... Вы тоже не в восторге?") 
        $hero  ("Хм. Конечно, я мог бы помочь вам, тем более, что я сразу выделил вас из серой массы. У вас есть вкус и стиль.") 
        $daphne("~55 00 1 def// Правда, сэр?") 
        $hero  ("Мисс, зачем директору Хогвартса обманывать в этом студентку. Конечно есть.// В отличие от большинства.") 
        $daphne("О, сэр. Вы это заметили! Это мугродье, они...") 
        $hero  ("#(Великие пески, только не это!)// Жаль, что правила Хогвартса предписывают придерживаться единой формы верхней одежды.") 
        $daphne("Да, сэр, это так. Но у меня и правда есть вкус, как у потомственной, чистокровной волшебницы. Такой вкус, что просто ух! Будь у меня такая возможность, я бы им показала что такое стиль.") 
        $hero  ("Но в общем-то у вас есть такая возможность.") 
        $daphne("~55 00 1 def// Есть?") 
        $hero  ("Ну. Вы же чирлидер, насколько я знаю.// И форма чирлидера в Хогвартсе предполагает некоторую индивидуальность и вы можете ее показать.")
        $daphne("~55 00 1 def// То есть, сэр, вы хотите, чтобы я...") 
        $hero  ("Да-да, Приходили сюда в форме чирлидера. Браво, мисс Гринграсс! Я знал, что вы схватываете быстро, но не думал, что настолько.")
        $daphne("~55 00 1 def// Спа-сибо, сэр. Но не кажется ли вам, что это несколько странно, если я буду приходить на занятия в этой форме. Она, несколько эм... вольная.") 
        $hero  ("Мисс Гринграсс, вас ведь не смущает, что вы отплясываете в этой форме перед всем Хогвартсом. Что же такого, если вы придете в ней в кабинет к вашему директору?")
        $daphne("~55 00 1 def// Но я не уверена...") 
        $hero  ("Возражения не принимаются. Жду вас в следующий раз в форме чирлидера.")

        $daphne("~55 00 1 def// Но вы так и не договорили, сэр, насчет того, что не в восторге и что могли бы.") 
        $hero  (m, "В следующий раз, мисс. Жду вас через два дня.") 
        $daphne("~55 00 1 def// ...") 
        $event.Finalize()

    elif event._finishCount==1: # Второй раз
        $hero  (m, "Замечательно, мисс Гринграсс. Вы выглядите просто сногсшибательно. При взгляде на вас у любого мужчины поднимется... эм. Настроение..") 
        $daphne("~55 00 1 def// Вы смущаете меня, профессор. И вряд ли я счастлива от того, что у мужчин что-то там поднимается.// Я так и знала, что если я приду к вам в этой форме, то все начнется!") 
        $hero  ("Хм. Прошу прощения, что я выразил восторг по поводу вашей внешности, мисс.// Вероятно, вы правы и мне не стоит отличать вас и делать вам комплименты.")  
        $daphne("Нет, сэр, я не это имела в виду. Просто... Мне дела нет, если у каких-то грязнокровок что-то там...") 
        $hero  ("\"Поднимается\"? Вы это хотели сказать, мисс?")  
        $daphne("Эм... Ну, да...") 
        $hero  ("Но если это происходит у чистокровных это ведь совсем другое дело, мисс.")  
        $daphne("Сэр, наша беседа принимает какую-то странную направленность! Если вы не прекратите, я немедленно уйду.") 
        $hero  ("Не прекращу что, мисс?")  
        $daphne("Обращать на меня ТАКОЕ внимание.") 
        $hero  ("И тем не менее, вы пришли.")  
        $daphne("Но не затем, чтобы вы про меня такое говорили!") 
        $hero  ("#(А зачем же еще, ведьма!)// Конечно, мисс, прошу меня простить.// Обещаю, впредь обращать на вас внимания ровно столько, сколько на любую грязнокровку.")  
        $daphne("Да нет же, сэр, вы все неправильно понимаете!") 
        $hero  (".......?// Хорошо, мисс, вероятно, сегодня не слишком удачный день для занятий. Возможно хороший подарок поднимет вам настроение.")  
        $event.Finalize()

    elif event._finishCount==2: # Третий раз
        $hero  (m, "Когда вы в этой форме, мисс Гринграсс, я вижу, какое у вас отличное тело. ")
        $daphne("~55 00 1 def// Сэр, вы опять!...") 
        $hero  ("Я тут подумал, почему бы вам не выступить в конкурсе мисс Хогвартс?") 
        $daphne("~55 00 1 def// Эмм... Это... это очень неожиданно, сэр. Вы и вправду считаете, что я могла бы?..") 
        $hero  ("Конечно могли бы. И что, как не победа в конкурсе вознесет вас на самый верх?")
        $daphne("~55 00 1 def// О!..") 
        $hero("У вас отличные шансы. Особенно, если за вас похлопочет директор Хогвартса")  
        $daphne("Сэр! Мне это не нужно, я – чистокровная волшебница в Мерлин знает каком поколении, я все получу сама безо всякого там покровительства.") 
        $hero  ("Ну, девочка, не нужно так возмущаться.// Конечно, ты заслуживаешь быть королевой, и я ни минуты не сомневаясь отдал бы тебе первое место прямо сейчас.//"
            "Но ты же понимаешь, сколько вокруг будет худородных, полукровок и откровенного мугродья.// И все они будут тебе завидовать. А МЫ не может допустить, чтобы ты проиграла.")
        $daphne("Мы?") 
        $hero  ("Мы - волшебники, которые занимают определенное ПОЛОЖЕНИЕ. Такой проигрыш нанесет урон всем НАМ. Ты же понимаешь это?")  
        $daphne("Хм, я не думала об этом...") 
        $hero  ("А следовало бы, мисс... Если вы готовы преподать урок всем недоволшебникам...")  
        $daphne("О, сэр, это мое самое большое желание! Показать им их место. Показать, кто здесь действительно кто. Всем этим девкам... Они меня не замечают, не признают, ну что ж, тем хуже для них!") 
        $hero  ("Отлично, мисс Гринграсс, мне нравится ваш боевой настрой. И я хочу поддержать его подарками.")  
        $event.Finalize()

    elif event._finishCount==3: # Четверты и последний раз
        $hero  (m, "Ну что ж, я заявил вас на конкурс. Как раз сейчас списки развешивают по Хогвартсу. А сова с заметкой об этом событии и списком участников уже летит в «Ежедневный пророк».") 
        $daphne("~55 00 1 def// О, сэр, все так быстро… я вообще-то не уверена,… я никогда до сих пор… Это нужно отменить!") 
        $hero  ("И как это будет выглядеть? Вчера вы готовы, а сегодня идете на попятный. Выходит, Дафна Гринграсс спасовала перед грязнокровками?// Впрочем, если это действительно то, чего вы хотите, я все отменю.")  
        $daphne("Н-нет, сэр, так нельзя. Но я не знаю что мне делать… вы… вы правда поможете мне.") 
        $hero  ("Конечно, мисс Гринграсс, если вы будете делать то, что я скажу, вам не о чем волноваться.// Вы даже получите удовольствие.")
        $daphne("Удовольствие, сэр? Не знаю, какое в этом может быть удовольствие.") 
        $hero  ("Поверьте мне, мисс, вы получите столько удовольствия, сколько не получали за свою жизнь. Только займите подходящее ПОЛОЖЕНИЕ, остальное даже вашего участия не потребует.")  
        $daphne("О, вы о положении, о котором мы с вами говорили?") 
        $hero  ("#(Хе-хе) Да, мисс, именно о нем.")  
        $daphne("Тогда, сэр, я готова приступить. Чтобы поскорее его занять.") 
        $hero  ("Отлично, мисс Гринграсс, и все-таки отдохните сегодня. Я вызову вас, чтобы мы могли приступить к настоящим занятим.// Думаю, вы заслуживаете подарка.")  
        $event.Finalize()

    menu:
        "- Дать ей подарок на прощание-":
            $ choose = RunMenu()
            python:
                for o in hero.Items():
                    if not o.Name in {"scroll"}:
                        choose.AddItem("- "+o._caption+" -", 
                            "daphne_giving" , True, o.Name)

            $ choose.Show("daphne_pre_finish_menu")

        "- Ничего -":
            $daphne("Тогда я, наверное, пойду.")


#    skaz "Жаль прерываться на самом интересном месте? "
#    skaz "Нам тоже. Но данная сюжетная линия пока дописана только до этой точки..."
#    skaz "(впрочем, вам доступны другие сюжетные линии)."
#    skaz "Оставьте ваши вопросы, благодарности и пожелания на нашем {a=http://wtrus.ixbb.ru/viewtopic.php?id=9}ФОРУМЕ{/a}. \nТак вы простимулируете нас и продолжение появится быстрее. :)"




    $screens.HideD3("bld1")
    $daphne.Visibility(transition=d3).chibi.Trans("goout door").Hide(d3)    
    $ renpy.play('sounds/door.mp3') #Sound of a door opening.
    pause.5

    $hero("...................................")

    return




