################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label daphne_pre_01: #Снейп обещает, что пришлет шлюху

    $snape.State(pos2=gMakePos( 340, 420 )).Visibility("head", transition=None)
    $hero("Послушай, Северус. Ты уже давно обещал прислать мне парочку слизеринских шлюх.")
    $snape("~29// Гхм...")
    $hero("Что значит твое «гхм»?... Я точно знаю, у тебя есть шлюхи!// Ты сам мне недавно хвалился, что делаешь что угодно с кем захочешь.")
    $snape("~03// Понимаешь, мой друг, все не так просто.//~04// Эти девки... Они уверены, что ты,... то есть, директор, не в курсе наших маленьких шалостей.")
    $hero("И?")
    $snape("~03// И если окажется, что директору тоже не чуждо стремление к потас...\n к прекрасному, то это разрушит все их мировоззрение...")
    $hero("Послушай, дружище. Мне нет дела до мировоззрения шлюх, в них меня интересуют совсем другие детали.") 
    $snape("~06// Да, но если они узнают о твоем интересе, они могут не захотеть больше этого делать.//~16// #(Надеюсь он проглотит эту хрень)//"
        "~29// #На самом деле я не собираюсь присылать ему шлюх -//"
        " #Он же, мать его, джинн, обладающий крутой космической силой и все такое!//~26// #Кто знает насколько он хорош в ЭТОМ.")
    $hero("Ты думаешь, я проглочу эту хрень?")
    $snape("~05//Хрень?//~04// Мой друг! Я о тебе забочусь! Они реально могут перестать давать!")
    $hero("Давать кому, дружище?// Не тебе ли?// Я думаю, тебе просто нравится быть единственным петухом в курятнике.//"
        "Я тут не досыпаю ночей, тружусь, чтобы выдрессировать тебе девчонку,...// а ты катаешься, как сыр в масле и не хочешь помочь мне с маленьким развлечением.")
    $snape("~01// Да что тебя не устраивает?!// ~02//Я слышал у вас очень хорошо продвигается с мисс Грейнджер.")
    $hero("Ты хочешь поменяться? Я готов уступить тебе воспитание этой девчонки всего за пару шлюх.") 
    $snape("~29// Эм...")
    $hero("Я тебя предупреждаю, Северус, если ты будешь и дальше утаивать от меня девок,...// директор может перестать скрываться в башне и выйдет сам на поиски!")
    $snape("~01// Но ты не можешь!..")
    $hero("Продолжай в том же духе и увидишь могу я или нет...")
    $snape("~06//......")
    $hero("......")
    $snape("~02//............")
    $hero("............")
    $snape("~23// Ладно-ладно...// Ты меня убедил. Я пришлю тебе шлюху.")
    $hero("Двух шлюх, Северус.")
    $snape("~28// Я уверен, ЭТА тебе заменит двух сразу.")
    $hero("Смотри, если это окажется какая-то уродка...")
    $snape("~01// За кого ты меня принимаешь!// Чистая кровь в Мерлин знает каком поколении, была на обложке \"Ведьмополитен\"...//"
        "~02// #(стоит крайняя в пятом ряду)// ~01// ...чирлидерша, слизеринка, наконец!//"
        "~23// Девица - пальчики оближешь!")
    $hero("Ну, это ее забота... облизывать...// Так в чем подвох?")
    $snape("~05// Подвох?")
    $hero("Ты слишком быстро согласился. Вот я и спрашиваю: в чем подвох? ")
    $snape("~23// Никакого подвоха, мой друг!// ~02//Ты сам убедишься. Потерпи пару дней. Всего пару дней!")
    $snape.Visibility()
    "> Вы решаете довериться Снейпу и подождать два дня."
    "> Остаток вечера вы слушаете стенания Северуса\n о нелегкой доле преподавателя и\n фантазируете об обещанной шлюхе."

    $event.Finalize()
    jump day_start


label daphne_pre_02: #LV.1 (Whoring = 0 - 2)
    $ renpy.play('sounds/knocking.mp3') #Sound someone knocking on the door.
    "*Тук-тук-тук!*"
    $daphne.Visibility()
    menu:
        "\"Кто это?\"":
            $daphne(who, "Сэр, меня прислал профессор Снейп...")
            $hero("#(Превосходно! Шлюха прибыла!)// #(Надеюсь, не слишком страшна на вид. Впрочем, после стольких дней воздержания я не очень переборчив.)")
        "\"Да, входи...\"":
            pass

#    skaz "Жаль прерываться на самом интересном месте? "
#    skaz "Нам тоже. Но данная сюжетная линия пока дописана только до этой точки..."
#    skaz "(впрочем, вам доступны другие сюжетные линии)."
#    skaz "Оставьте ваши вопросы, благодарности и пожелания на нашем {a=http://wtrus.ixbb.ru/viewtopic.php?id=9}ФОРУМЕ{/a}. \nТак вы простимулируете нас и продолжение появится быстрее. :)"
    $daphne.LoadDefItemSets()
    $daphne.chibi.State("door", speed="go").Trans(d4, "go center", "blink") 
    $hermi.chibi.State("door", speed="go").Trans(d4, "go center", "blink") 
    pause.5
    $screens.ShowD3("bld1")



    $daphne.State(pos="door").Visibility("body+")("~55 00 3 opT// Добрый день, профессор Дамблдор.") 
#    $hermi.Visibility("body+")(".....")

    $screens.Show("ctc").Pause()

    $hero  (m, "#(О, девица вполне товарного вида. Сиськи, правда, маловаты. Интересно, есть ли заклинание, чтобы их подрастить?..)", 
        g4, "#(Нет, джинни, остановись, ты уже подрастил сиськи принцессе... мда)", 
        m, "Добрый день э-э... #(Великие пески, почему он не сказал как ее зовут?).") 
    $daphne("~55 00 3 opT// Профессор Снейп сказал, что вы хотели меня видеть.") 
    $hero  ("Эм, да. Несомненно хотел... видеть.// Но, он же сказал зачем я хотел тебя видеть?") 
    $daphne("~55 00 3 opT", "Нет, сэр. Он не сказал.") 
    $hero  ("#(Наверное, нужно с ней немного поболтать. Просто для разогрева.)") 

    menu: 
        "Поговорить насчет учебы": 
            $hero  ("Что ж, мисс, я хотел поговорить насчет вашей учебы.") 
            $daphne("55 00 3 opT",  "Учеба не то, что меня волнует, сэр.// Меня гораздо больше волнует, почему в Хогвартсе обучается грязнокровое мугродье.//" 
                "Вы же чистокровный волшебник, сэр?") 
            $hero  (g4, "Кто? Я?.. А, ну да. Вроде того.") 
            $daphne("55 00 3 opT",  "Да, вы по делу смущаетесь.// По древности рода с Гринграссами никто не сравнится, так что вы и должны чувствовать себя неловко.") 
            $hero  (m,"(Гринграссы? Что это еще за хрень?)") 
            $daphne("55 00 3 opT",  "Но как бы то ни было, сэр. Вы должны проследить, чтобы  мугродье не чувствовало себя здесь вольготно.", 
                "А вы вместо этого приглашаете новых. И чистокровные девочки должны испытывать сложности.") 
            $hero  ("Чистокровные девочки?") 
            $daphne("55 00 3 opT",  "Да, сэр! Почему эту грязнокровку называют лучшей на курсе?//"
                " Как это мугродье вообще может дышать одним воздухом с истинными волшебниками?//" 
                "55 00 3 opT// Я могу еще быть рядом со всякими Малфоями или Паркинсон.//" 
                "Семейки так себе, второй сорт. Но какие-никакие чистокровки, а эта девица!!!") 
        "Поговорить насчет факультета": 
            $hero  ("Что ж, мисс, я хотел поговорить об обстановке на факультете.") 
            $daphne("55 00 3 opT",  "Обстановка на факультете, сэр? Она отвратительна!// Грязнокровое мугродье заполонило Хогвартс.") 
            $hero  ("#(Что это за?..)") 
            $daphne("55 00 3 opT",  "И вы делаете вид, что этого не знаете. Хотя ваш отец...// Он не посрамил своей колдовской чести и прикончил троих маглов, за что его и упрятали в Азкабан.") 
            $hero  ("Правда, что ли? #(Что за висельники в родстве с местным директором?)") 
            $daphne("55 00 3 opT",  "Не притворяйтесь, что вы этого не помните, сэр!// А если позабыли, это не делает вам чести!", 
                "Гринграссы всегда стояли за чистоту крови и когда видишь волшебника, который предает наши идеалы...") 

    $hero  ("#(Хм, какая экспрессия! Интересно трахается она так же энергично?)// Постойте, мисс, это все очень увлекательно, но, может, уже завершим прелюдию и приступим?") 
    $daphne("55 00 3 opT// Приступим к чему, сэр?") 
    $hero  ("Ну, к этому самому... чпоки-чпоки, тити-мити, а?") 
    $daphne("55 00 3 opT",  "\"Чпоки-чпоки\", сэр?") 
    $hero  ("Ну я не знаю, как это у вас, девушек, называется.// В общем, то, что вы постоянно делаете с профессором и зачем он вас сюда прислал.") 
    $daphne("55 00 3 opT// Я не понимаю, сэр.") 
    $hero  ("О, великие пески пустыни!// #(Она небыстро шевелит мозгами. Надеюсь, что бедрами шевелит быстрее.)//" 
        "Я говорю, заняться тем, чем обычно занимаются шлю... девчонки вроде вас.") 
    $daphne("55 00 3 opT// На что это вы намекаете?!") 
    $hero  ("Я намекаю? Да я прямо говорю!...") 
    $daphne("55 00 3 opT",  "Если вы смеете намекать на то, чем занимаются некоторые особы с преподавателями, то это омерзительно!") 
    $hero  ("#(Э-э, Снейп, это что, шутка?)") 
    $daphne("55 00 3 opT",  "Я сегодня же пошлю сову родителям и сообщу о грязных предложениях, которые вы мне тут делаете.//", 
        "А уж они донесут об этом в министерство, будьте уверены.") 
    $hero  (g4, "#(Не могу поверить!... Чертов Снейп!!!)// Эм, постойте, мисс, вы неправильно поняли!") 
    $daphne("55 00 3 opT// Я все правильно поняла! Вам недолго осталось сидеть в этом кресле!") 

    $daphne.Visibility()

    $screens.HideD3("bld1")
    $daphne.Visibility(transition=d3).chibi.Trans("goout door").Hide(d3)    
    $ renpy.play('sounds/door.mp3') #Sound of a door opening.
    pause.5

    $hero("...................................")


    $event.Finalize()
    return
#    jump day_start
