label herooflight:
# Воин типа света
# Воин кабы света
    # if первый раз 
    $say("В тридевятом царстве, тридесятом государстве мирно правил мудрый король Сократий.// Но однажды глашатаи на королевских площадях объявили, что случилась беда - коварный дракон похитил прекрасную принцессу Анабеллу.//"
        "И как водится призываются храбрые юноши, настоящие Воины Света, которые отправятся в зачарованный лес и спасут принцессу.//"
        "Счастливцу прекрасная Анабелла в жены и полцарства впридачу.//"
        "Король принимает вас одного из немногих и в разговоре намекает, что //"
        "Вы отправляетесь в лес.")


label hol_rapuncel:
    $say("Вы долго идете по лесу и видите высокую башню высоко вверху вы замечаете в окне привлекательную девушку с длинными золотистыми волосами, которая машет вам рукой.//"
    "Вы представляетесь, как Воин Света, узнаете, что ее зовут Рапунцель и она хочет поболтать с вами и узнать как живут люди в большом мире. Но впускать вас или спускаться к вам она не хочет - мама не велит.")
    menu:
        "Поговорить":
            $say("Вы рассказываете ей, как живут люди в большом мире.")
            if False: #
                $say("Вы говорите, что если она хочет получить подарок она должна спуститься или вы подняться к ней.")
                menu:
                    "Попросить спуститься":
                        $say("Девушка говорит, что вообще-то мама не велит, но она думает, что ничего плохого в этом нет... Она привязывает свои волосы к решетке на окне и спускается вниз.//"
                        "Вы даете ей подарок и оценивающе осматриваете ее.//"
                        "Она смущается начинает прощаться и собирается лезть обратно, но вы останавливаете ее и говорите, что хорошо воспитанная девушка должна кое-что подарить в ответ."
                        "Так что или она будет послушной и тогда ее суровая мамочка обнаружит ее спящей в кроватке и о том, что тут произошло никто лишний не узнает.//" 
                        "Или вам придется остричь ее роскошные волосы, а ее одежда окажется в грязи и беспорядке. И тогда ей будет очень трудно объяснить мамочке как это все произошло."
                        "Рапунцель начинает хныкать, но приходит к правильному решению и спустя пару минут стоит со спущенными трусиками, опершись руками о башню, а вы трудитесь над ее узкой щелкой."
                        "Хныкания быстро сменяются легкими стонами и под конец девушка начинает даже подмахивать.")
                    "Попросить впустить":
                        $say("Девушка говорит, что вообще-то мама не велит, но она думает, что ничего плохого в этом нет... Она привязывает свои волосы к решетке на окне и вы по ним забираетесь внутрь.//"
                        "Вы даете ей подарок...")
                        menu:
                            "Приступить к делу, не откладывая":
                                $say("...и оценивающе осматриваете ее.//"
                                "Она смущается начинает прощаться, пытаясь выпроводить вас обратно, но вы останавливаете ее и говорите, что хорошо воспитанная девушка должна кое-что подарить в ответ.//"
                                "Рапунцель предлагает вам волшебный гребень.")
                                menu:
                                    "Взять гребень":
                                        $say("Вы берете гребень")
                                        $tailItems.update({"гребень":tailItems["гребень"]+1})
                                        menu:
                                           "Не спешить уходить":
                                               pass
                                           "Поторопиться уйти":
                                               $say("Вы прощаетесь с Рапунцель, спускаетесь по ее волосам вниз и идете дальше.")
                                    "Этого слишком мало":
                                        label hol_rapuncel_bed:
                                        $say("Вы не спешите уходить и говорите, что гребень это замечательно, но от такой красивой девушки вы рассчитываете получить большее.//"
                                        "Вы ловите за руку пытающуюся улизнуть Рапунцель и предлагаете на выбор: или все происходит по-хорошему и никто лишний ничего не узнает//"
                                        "...или ей придется объяснять маме откуда у нее взялся фингал и порванная одежда.")
                                        $say("Рапунцель начинает хныкать, но больше не пытается убежать. Вы отводите ее в ее спальню, заставляете раздеться и с удовольствием трахаете в ее кроватке.//"
                                        "Но когда вы уже близки к эпическому финалу на ваш затылок обрушивается что-то тяжелое и вы теряете сознание.")
                                        $say("Вы приходите в себя и чувствуете, что лежите на спине на чем-то твердом, руки и ноги крепко привязаны, а во рту кляп.//"
                                        "Над вами стоят Рапунцель и какая-то тетка. Не обращая внимания на вас, тетка говорит Рапунцель, что, видимо, пора заняться ее половым воспитанием.//"
                                        "Что мама умней и она научит Рапунцель, как использовать мужчин, чтобы получать удовольствие.// А гость наш в этом поможет, правда?//"
                                        "Поскольку она улыбаясь опускает что-то остроотточенное вам ниже пояса, вам остается только усиленно кивать...")
                                        # Бед финал Рапунцель1
                            "Поговорить":
                                $say("Вы болтаете с Рапунцель о всякой всячине, постепенно придвигаясь ближе. Потом кладете руку ей на бедро.//"
                                "Она пытается освободиться, но вы начинаете вдохновенно расписывать, как современные девушки реагируют на прикосновения мужчин (описывая знакомых проституток).//"
                                "Рапунцель стыдится своей замшелой реакции и когда вы двигаете рукой выше краснея раздвигает бедра, поглядывая на вас - достаточно ли она современна.//"
                                "В конце концов вы лишаете ее девственности прямо на полу, но когда вы уже близки к эпическому финалу, слышен звук ключа в двери и шаги.")
                                $say("Рапунцель прячет вас в маленькой комнатке. Ночь вы проводите в одиночестве. Вы решаете сбежать завтра, когда ее мамочка-колдунья свалит.//"
                                    "Наконец, вам удается заснуть, но утром обнаруживаете на ноге цепочку, соединяющую вашу лодыжку с кольцом в стене.")
                                $say("Вы пытаетесь устроить сцену, появившейся Рапунцели, но она с круглыми глазами говорит, что это только для вашей безопасности.//" 
                                    "Она приотрывает дверь и показывает развешанные на стене головы и банки с заспиртованными гениталиями особ мужского пола, которые попадались ее мамочке.//"
                                    "После такой демонстрации желание спорить у вас пропадает.//"
                                    "А Рапунцель, хихикая, показывает журналы с тетками в коже на обложке, которые она стащила у мамочки и начинает требовать, чтобы вы ее вылизали, потому что современным девушкам это нравится.//"
                                    "Вы пытаетесь отказаться. Она немедленно выходит из себя и начинает шуметь, что раз вы такой бесполезный, значит зря она прячет вас от мамочки.//"
                                    "Поскольку мамочка все еще где-то здесь, вы ловите девчонку у двери извиняетесь и делаете то что она просит.//"
                                    " А потом сидите и думаете о том, что вам предстоит еще много таких почти одинаковых дней. Впрочем, возможно не очень много...")
                                        # Бед финал Рапунцель2


# Дважды гребаные пески!! Что это за финал такой??? Я ведь Воин Света в конце концов, это я должен всех трахать! Что за херня! Акабур такого бы никогда не написал...





     
        
        
        
        
        
        
        
        
        
