################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label dap_request_02: #LV.1 (Whoring = 0 - 2)
    $music("Daphne Theme")

    if IsRunNumber(1):
        $hero("Итак, мисс Гринграсс. Настало время поучиться вам держаться на сцене. Вы готовы?")
        $daphne("~55 00 1 def// Да, сэр, что я должна сделать? Ходить?")
        $hero("Нет, мисс, лежать.")
        $daphne("~46 w0 1 def// ...?!")
        $hero(g4, "Ох, прошу прощения, мисс, я смотрел на вас и вдруг замечтался...")
        $daphne("~37 s0 1 neu// О чем это вы замечтались?")
        $hero("Я-то? Замечтался о... о проблемах факультета, да...",
            m," Нет-нет, не нужно ничего такого сложного \"ходить, лежать\"... Просто уменьшим количество вашей одежды.")
        $daphne("~37 c0 1 dis// Одежды, сэр? Но... я и сейчас в такой одежде, что мама посчитала бы это одеждой шлюхи!")
        $hero("Мисс Гринграсс, на конкурсе не будет вашей мамы, но будет жюри, которое ожидает увидеть конкурсанток в подходящих нарядах.// Вы, конечно, можете выйти на подиум в, как это по-рюсски... v tulup.//"
         "Но вряд ли ваш стиль оценят. На вас должно оставаться минимум одежды, чтобы члены жюри отметили вашу внешность.")
        $daphne("~73 c0 1 pri// О, сэр. Это... это ужасно. Меня будут рассматривать, как породистую ... лошадь!")
        $hero("#Хе-хе. Вариант \"суку\" мне нравился больше.")
        $daphne("~73 00 1 pri// Вы что-то сказали, сэр?")
        $hero("О, это не стоит вашего внимания, мисс. Так от чего вы избавитесь вначале?")
        $daphne("~73 00 1 ehh// Ну, я могу сменить топ на более открытый. Надеюсь, этого достаточно?")
        $hero("Мисс, это ваш конкурс ваш успех и ваш провал. Вам решать достаточно этого или нет.")
        $daphne("~73 01 1 pur// Хм,... Ну, я надеюсь, что этого пока хватит.")

        $screens.Show(Dissolve(1), "blkfade") #Completely black screen.
        $daphne.chibi.Hide()
        $daphne.ItemsCustomize(delete={"sleeves"}).chibi.State(appearance="c").Refresh()
        pause.5
        $screens.Hide(Dissolve(1), "blkfade") #Completely black screen.
        $screens.Show("ctc").Pause().Hide("ctc")

        $hero("У вас симпатичные руки, мисс Гринграсс, я никогда не видел их обнаженными.")
        $daphne("~73 00 2 ang// Ох, сэр, пожалуйста.")
        $hero("Зеленые лямки лифчика не слишком гармонируют.")
        $daphne("~73 00 2 pou// Ох, сэр, ну я же рассчитывала, что придется...")
        $hero("Оголяться перед мужчиной?")
        $daphne("~73 n2 3 def// Ну, да...")
        $hero("Все в порядке, мисс. Вы выглядите очень привлекательно. Думаю, вы заслужили сегодня небольшую награду.")
    elif IsRunNumber(2):
        $hero("Ну что ж, мисс Гринграсс. Давайте дальше учиться держаться на сцене.")
        $daphne("~55 00 2 def// Мне ходить... или?")
        $hero("Или! Вам надо избавиться еще от одной детали одежды.")
        $daphne("~46 00 2 ehh// Отлично, давно хотела снять эти чулки, в них я выгляжу по-уродски.")

        $screens.Show(Dissolve(1), "blkfade") #Completely black screen.
        $daphne.ItemsCustomize(delete={"stockings"}).chibi.State(appearance="c").Refresh()
        pause.5
        $screens.Hide(Dissolve(1), "blkfade") #Completely black screen.
        $screens.Show("ctc").Pause().Hide("ctc")


        $hero("Вот это энтузиазм! Вам следует сохранять его, мисс, пока вы будете снимать всю остальную одежду.")
        $daphne("~46 w0 1 ehh// ВСЮ?!...")
        $hero(g4, "Эм... Это я образно, мисс.",m ,"Давайте лучше посмотрим, что я сегодня смогу вам подарить.")
    elif IsRunNumber(3):
        $hero("Итак, мисс Гринграсс, ваша форма приближается к той, в которой вы будете выступать.")
        $daphne("~55 00 1 neu// Сэр, она и так уже почти такая!")
        $hero("Отнюдь, мисс, нам еще многое предстоит. Пора избавиться от еще одной вещи.")
        $daphne("~55 00 1 ehh// От какой?")
        $hero("Решите сами, мисс.")
        $daphne("~26 01 2 ope// Вы же не ожидаете, сэр, что я буду демонстрировать вам нижнее белье?! Как это будет выглядеть?!")
        $hero("На сцене на вас должно остаться только то, что вы называете нижним бельем, мисс.//"
            "Кстати, уверен, ВАШЕ нижнее белье самого высокого качества и подобрано с присущим вам изяществом...//"
            "Так что его не стыдно продемонстрировать в самом изысканном обществе.")
        $daphne("~26 01 2 smi// Эм... Вы, конечно, правы, сэр.")
        $hero("#(Гребаные пески, все время приходится следить за языком, чтобы не ляпнуть \"На колени, шлюха!\")")
        $daphne("~37 00 2 smi// Я говорю, вы правы, насчет изящества...//~73 00 2 smi// Сэр?")
        $hero("А? Да, так о чем я... Я с удовольствием полюбуюсь вашим нижним бельем, мисс. Когда вы будете готовы, конечно.")
        $daphne("~73 01 2 ehh// О... Я даже не знаю... Оно действительно изящное, в конце концов я волшебница в Мерлин знает каком!...")
        $hero("#(Только она начинает нести эту пургу, у меня тут же все опускается...)")
        $daphne("~73 01 2 pur// Но я пока не готова, сэр. И раз сегодня нужно что-то снять...//~55 01 2 pou// Тогда я сниму лифчик. Отвернитесь, сэр!//~55 01 3 pou// Хотя нет, лучше я сама отвернусь.")

        $screens.Show(Dissolve(1), "blkfade") #Completely black screen.
        $daphne.ItemsCustomize(delete={"bra"}, update={"combi:cheer_topbase_withnipples"}).chibi.State(appearance="f").Refresh()
        pause.5
        $screens.Hide(Dissolve(1), "blkfade") 
        $screens.Show("ctc").Pause().Hide("ctc")

        $hero("Гхм, вы решили показать мне ваши стоящие соски? Я оценил, они превосходны!")
        $daphne("~37 00 2 ope// Что?! Сэр!")
        $hero("Мисс Гринграсс, вы могли снять блузку и за вашим плотным лифчиком я бы не увидел этих волнующих подробностей.// Но вы предпочли продемонстрировать мне, что возбуждены.")
        $daphne("~26 00 3 wo// Что? Нет! Да как вы смеете!")
        $hero("Мисс Гринграсс, не нужно сердиться, это хорошая новость, что вы возбуждаетесь, когда демонстрируете себя мужчине.// Это поможет вам и не только на конкурсе.")
        $daphne("~26 00 3 ope// Это... это совсем не из-за того, что я сняла лифчик, чтоб вы знали!")
        $hero("Хм. Неужели вас так возбудил разговор о том, как вы будете стоять перед зрителями в одном нижнем белье?")
        $daphne("~26 00 3 dis// Сэр, это просто за гранью!!! Я немедленно пожалуюсь родителям!")
        $hero("Которым вы даже не сообщили, что пытаетесь стать Мисс Хогвартс?//"
            "Они ведь не читают \"пророка\", не так ли?")
        $daphne("~55 s0 3 pou")
        $hero("Полагаю, вы хотели торжественно вернуться с победой, либо сохранить в тайне, если провалитесь.//"
            "Но вряд ли, девушка, от миссис Гринграсс удастся скрыть, если вы со свистом вылетите в первом туре.//"
            "Ваши недруги на факультете об этом позаботятся.//")
        $daphne("~37 01 3 dis// ........................")
        $hero("#(Похоже, я все же немного перегнул палку... Но думаю, девушка слишком много поставила на этот конкурс, так что все обойдется.)//"
            "Мисс, конечно, как поступить, решать вам.// Но в знак моего особого к вам отношения подарок вам я все равно приготовил.")
        $daphne.liking-=15

    if daphne.whoring<=2:
        $daphne.whoring=event._finishCount+1
    return

