################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label dap_request_02: #LV.1 (Whoring = 0 - 2)
    play music "music/Chipper Doodle v2.mp3" fadein 1 fadeout 1 

    if IsRunNumber(1):
        $hero("~55 00 1 def// Итак, мисс Гринграсс. Настало время поучиться вам держаться на сцене. Вы готовы?")
        $daphne("Да, сэр, что я должна сделать? Ходить?")
        $hero("Нет, мисс, лежать.")
        $daphne("~46 w0 0 def// ...?!")
        $hero(g4, "Ох, прошу прощения, мисс, я смотрел на вас и вдруг замечтался...")
        $daphne("~37 s0 1 neu// О чем это вы замечтались?")
        $hero("Я-то? Замечтался о... о проблемах факультета, да...// Нет-нет, не нужно ничего такого сложного ходить, лежать... Просто давайте уменьшим количество вашей одежды.")
        $daphne("~37 c0 1 dis// Одежды, сэр? Но... я и так в такой одежде, что мама посчитала бы это одеждой шлюхи!")
        $hero("Мисс Гринграсс, на конкурсе не будет вашей мамы, но будет жюри, члены которого которые ожидают увидеть конкурсанток в подходящих нарядах.// Вы, конечно, можете выйти на подиум в, как это по-рюсски... v tulup.//"
         "Но вряд ли ваш стиль оценят. На вас должно оставаться минимум одежды, чтобы члены жюри отметили вашу внешность.")
        $daphne("~73 c0 1 pri// О, сэр. Это... это ужасно. Меня будут рассматривать, как породистую ... лошадь!")
        $hero("#Хе-хе. Слово «суку» мне кажется более подходящим.")
        $daphne("~73 00 1 pri// Вы что-то сказали, сэр?")
        $hero("Нет, ничего, мисс. Так от чего вы избавитесь вначале?")
        $daphne("~73 00 1 ehh// Ну, я могу сменить топ на более открытый. Надеюсь, этого достаточно?")
        $hero("Мисс, это ваш конкурс ваш успех и ваш провал. Вам решать достаточно этого или нет.")
        $daphne("~73 01 1 pur// Хм,... Ну, я надеюсь, что этого пока хватит.")
        # Смена одежды в т.ч. и на яибике
        $hero("У вас симпатичные руки, мисс Гринграсс, я никогда не видел их обнаженными.")
        $daphne("~73 00 2 ang// Ох, сэр, пожалуйста.")
        $hero("Зеленые лямки лифчика выглядят не слишком гармонично.")
        $daphne("~73 00 2 pou// Ох, сэр, ну я же рассчитывала, что придется...")
        $hero("Оголяться перед мужчиной?")
        $daphne("~73 n2 3 def// Ну, да...")
        $hero("Все в порядке, мисс. Вы выглядите очень привлекательно. Думаю, вы заслужили сегодня небольшую награду.")
    elif IsRunNumber(2):
        $hero("Ну что ж, мисс Гринграсс. Давайте дальше учиться держаться на сцене.")
        $daphne("~55 00 2 def// Мне ходить... или?")
        $hero("Или! Вам надо избавиться еще от одной детали одежды.")
        $daphne("~46 00 2 ehh// Отлично, давно хотела снять эти чулки, в них я выгляжу по-уродски.")
        $hero("Вот это энтузиазм! Вам следует сохранять его, мисс, пока вы будете снимать всю остальную одежду.")
        $daphne("~46 w0 1 ehh// ВСЮ?...")
        $hero(g4, "Эм... Это я образно, мисс.",m ,"Давайте лучше посмотрим, что я сегодня смогу вам подарить.")
    elif IsRunNumber(3):
        $hero("Итак, мисс Гринграсс, ваша форма приближается к той, в которой вы будете выступать.")
        $daphne("~55 00 1 neu// Сэр, она и так уже почти такая.")
        $hero("Отнюдь, мисс, нам предстоит еще долгий путь. Пора избавиться от еще одной вещи.")
        $daphne("~55 00 1 pou// Ну... ладно.//~55 01 1 pou// Тогда я сниму лифчик. Отвернитесь, сэр!//~55 01 2 pou// Хотя нет, лучше я сама отвернусь.")
        # Черный экран
        $hero("Гхм, вы решили показать мне ваши стоящие соски? Я оценил, они превосходны!")
        $daphne("~37 00 2 ope// Что?! Сэр!")
        $hero("Мисс Гринграсс, вы могли снять блузку и за вашим плотным лифчиком я бы не увидел этих волнующих подробностей.// Но вы предпочли продемонстрировать мне, что возбуждены.")
        $daphne("~26 00 3 ope// Что? Нет! Да как вы смеете!")
        $hero("Мисс Гринграсс, не нужно сердиться, это хорошая новость, что вы возбуждаетесь, когда демонстрируете себя мужчине.// Это поможет вам и не только на конкурсе.")
        $daphne("~26 00 3 dis// Сэр, это просто за гранью!!! Я немедленно пожалуюсь родителям!")
        $hero("Которым вы даже не сообщили, что пытаетесь стать Мисс Хогвартс?//"
            "Они ведь не читают \"пророка\", не так ли?//"
            "Полагаю, вы хотели торжественно вернуться с победой, либо сохранить в тайне, если провалитесь."
            "Но вряд ли, девушка, от миссис Гринграсс удастся скрыть, если вы со свистом вылетите в первом туре.//"
            "Ваши недруги на факультете об этом позаботятся.//")
        $daphne("~37 01 3 dis// ........................")
        $hero("Конечно, как поступить, решать вам. Ну а подарок вам я все равно приготовил.")
        $daphne.liking-=15

    $daphne.whoring=daphne._finishCount
    call daphne_pre_menu(None)
    return event.Finalize()

