################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label dap_request_02: #LV.1 (Whoring = 0 - 2)
    play music "music/Chipper Doodle v2.mp3" fadein 1 fadeout 1 

    if IsRunNumber(1):
        $hero("Итак, мисс Гринграсс. Пора вам поучиться держаться на сцене. Вы готовы?")
        $daphne("Да, сэр, что я должна сделать? Ходить?")
        $hero("Нет, мисс, лежать.")
        $daphne("...?!")
        $hero("Ох, прошу прощения, мисс, я задумался о... делах факультата.// Нет-нет, не нужно ничего такого сложного. Просто давайте уменьшим количество вашей одежды.")
        $daphne("Одежды, сэр? Но... я и так в такой одежде, что мама посчитала бы это одеждой шлюхи!")
        $hero("Мисс Гринграсс, на конкурсе не будет вашей мамы, но будет жюри, члены которого которые ожидают увидеть конкурсанток в подходящих нарядах.// Вы, конечно, можете выйти на подиум в, как это по-рюсски... v tulup.//"
         "Но вряд ли ваш стиль оценят. На вас должно оставаться минимум одежды, чтобы члены жюри оценили вашу внешность.")
        $daphne("О, сэр. Это… это ужасно. Меня будут рассматривать, как породистую сук… эм, лошадь!")
        $hero("Хе-хе. «Суку» мне кажется более точным.")
        $daphne("Вы что-то сказали, сэр?")
        $hero("Нет, ничего, мисс. Так от чего вы избавитесь вначале?")
        $daphne("Ну, я могу сменить топ на более открытый. Надеюсь, этого достаточно?")
        $hero("Мисс, это ваш конкурс ваш успех и ваш провал. Вам решать достаточно этого или нет.")
        $daphne("Хм,… Ну, я надеюсь, что этого пока хватит.")
        $hero("У вас симпатичные руки, мисс Гринграсс, я никогда не видел их обнаженными.")
        $daphne("Ох, сэр, пожалуйста.")
        $hero("Зеленые лямки лифчика выглядят не слишком гармонично.")
        $daphne("Ох, сэр, ну я же рассчитывала, что придется…")
        $hero("Оголяться?")
        $daphne("Ну, да…")
        $hero("Все в порядке, мисс. Вы выглядите очень привлекательно. Думаю, вы заслужили сегодня небольшую награду.")
    elif IsRunNumber(2):
        $hero("Ну что ж, мисс Гринграсс. Давайте дальше учиться держаться на сцене.")
        $daphne("Мне ходить… или?")
        $hero("Или! Вам надо избавиться еще от одной детали одежды.")
        $daphne("Отлично, давно хотела снять эти чулки, в них я выгляжу по-уродски.")
    elif IsRunNumber(3):
        $hero("Итак, миссс Гринграсс, приближаем нашу форму к форме на конкурсе.")
        $daphne("Сэр, она итак уже почти как на конкурсе.")
        $hero("Мне лучше знать.")
        $daphne("Отлично, тогда я сниму лифчик.")
        $hero("Гхм, вы хотите показать мне ваши стоящие соски?")
        $daphne("Что? Сэр!")
        $hero("Мисс Гринграсс, вы могли снять блузку и за вашим плотным лифчиком я бы не увидел этих волнующих подробностей. Но вы предпочли продемонстрировать мне, что вы возбуждены.")
        $daphne("Что? Нет! Да как вы смеете!")
        $hero("Мисс Гринграсс, не нужно сердиться, это хорошая новость, что вы возбуждаетесь, когда оголяетесь.")
        $daphne("Сэр, это просто за гранью!!! Я немедленно пожалуюсь родителям!")
        $hero("Которым вы даже не сообщили, что участвуете в конкурсе? Они ведь не читают прорицательскую, не так ли? Думаю, вы хотели торжественно вернуться с победой, либо сохранить в тайне, если провалитесь. Но вряд ли, мисс, последнее удастся скрыть, если вы со свистом вылетите в первом туре. Ваши недруги на факультете позаботятся. В общем, решать вам.")
    return

