################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label dap_interlude_02: #LV.1 (Whoring = 0 - 2)

    $hero("Мисс? Что это с вами. На вас столько одежды.")
    $daphne("А, сэр? Ничего… Просто, мне холодно.")
    $hero("А мне сдается, что вы напялили на себя столько тряпок, чтобы возникли проблемы их снять.")
    $daphne("Сэр! Я вообще считаю, что я не должна быть полуобнаженной перед вами.")
    $hero("Отлично, мисс. Возможно, тогда вам и вашим родителям нужно найти кого-нибудь другого, чтобы занимался вашим положением в Хогвартсе и готовил вас к конкурсу. Возможно, вам будет проще раздеться перед профессором Снейпом? Или Миневрой Макгонагол? Может, мне поговорить с ней?")
    $daphne("О, сэр, только не профессор Макгонагол. Все знают, что она не любит девочек.")
    $hero("Ну и кто остается, Снейп?")
    $daphne("Нет, сэр. Не надо профессора Снейпа. Я буду заниматься с вами.")
    $hero("Тогда вот что, мисс. Если мы с вами избавились от рукавов, значит на следующее занятие вы приходите уже без рукавов. И больше никогда их не одеваете. Вам нужно привыкнуть оголять… быть не очень стесненной одеждой.")
    $daphne("Но сэр!")
    $hero("Никаких сэров! Прямо сейчас вам следует одеть блузку без рукавов. Чулки можете оставить, в них вы выглядите по-уродски.")
    $daphne("По-уродски, сэр? Тогда я их тоже сниму.")
    $hero("Нет уж, дорогая. Вы сами их на себя напялили, так что теперь расплачивайтесь. Переодевайтесь и приступим к занятиям.")

    $screens.HideD3("bld1")
    $daphne.Visibility(transition=d3).chibi.Trans("goout door").Hide(d3)    
    $ renpy.play('sounds/door.mp3') #Sound of a door opening.
    pause.5
    $event.Finalize("night_start" if daytime else "day_start")