################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label dap_interlude_02: #LV.1 (Whoring = 0 - 2)
    $daphne.ItemsCustomize(update={"stockings"}, chibi="c")

    $daphne.State(pos="door").Visibility("body+")("~55 00 1 def// Добрый день, профессор Дамблдор.") 
    $hero("Мисс?// Что это с вами? На вас столько одежды...")
    $daphne("~46 01 1 ehh// Ничего, сэр... Просто, мне холодно.")
    $hero("А мне сдается, что вы напялили на себя столько тряпок, чтобы их было сложно снять.")
    $daphne("~37 01 1 ope// Сэр! Я вообще считаю, что не должна быть полуобнаженной перед вами.// Конкурс конкурсом, но постепенно раздеваться перед мужчиной это...// Это словно готовиться лечь в его постель!")
    $hero("#Почему сразу в постель? Профессорский стол тоже очень неплохое место.")
    $daphne("~37 01 1 ope// Что вы сказали, сэр?")
    $hero("Я сказал, мисс, что понял вас. Если вам неприятны мой искренний интерес и участие...//"
        "Тогда вам и вашим родителям лучше найти кого-нибудь другого, чтобы занимался вашим положением в Хогвартсе и готовил вас к конкурсу.//"
        "Возможно, вам будет проще раздеться перед профессором Снейпом?//"
        "Или Миневрой Макгонагол? Может, мне поговорить с ней?")
    $daphne("О, сэр, только не профессор Макгонагол. Все знают, что она не любит девочек!")
    $hero("Ну и кто остается, Снейп?")
    $daphne("Нет, сэр. Не надо профессора Снейпа. Я буду заниматься с вами.")
    $hero("Тогда вот что, мисс. Если мы с вами избавились от рукавов, значит на следующее занятие вы приходите уже без рукавов. И больше никогда их не одеваете.// Вам нужно привыкнуть оголять... быть не очень стесненной одеждой.")
    $daphne("Но, сэр!")
    $hero("Никаких сэров! Прямо сейчас вам следует одеть блузку без рукавов. Чулки можете оставить, в них вы выглядите по-уродски.")
    $daphne("По-уродски, сэр? Тогда я их тоже сниму.")
    $hero("Нет уж, дорогая. Вы сами их на себя напялили, так что теперь расплачивайтесь...// Приступайте мисс, я жду.")
    #темнота переодевание в т.ч. и чибика
    $daphne("Вот. Теперь другое дело.")

    return $event.Finalize() # возвращается в глвное меню