################
### LEVEL 01 ###                
###################REQUEST_01 JUST STAND THERE.
label dap_interlude_02: #LV.1 (Whoring = 0 - 2)
    $screens.ShowD3("bld1")
    $daphne.ItemsCustomize(update={"stockings", "sleeves"})
    $daphne.chibi.State("center", appearance="d").Trans(d4, "blink")

    $daphne.State(pos="door").Visibility("body+")
    $screens.Show("ctc").Pause().Hide("ctc")
    $daphne("~55 00 1 def// Добрый день, профессор Дамблдор.")

    $hero("Мисс?// Что это с вами? На вас столько одежды...")
    $daphne("~46 01 1 ehh// Ничего, сэр... Просто, мне холодно.")
    $hero("А мне сдается, что вы напялили на себя столько тряпок, чтобы их было сложно снять.")
    $daphne("~37 01 1 ope// Сэр! Я вообще считаю, что не должна быть полуобнаженной перед вами.// Конкурс конкурсом, но постепенно раздеваться перед мужчиной это...// Это словно готовиться лечь в его постель!")
    $hero("#Почему сразу в постель? Профессорский стол тоже очень подходящее место.")
    $daphne("~37 00 1 def// Что вы сказали, сэр?")
    $hero("Я сказал, мисс, что понял вас. Если вам неприятны мои искренний интерес и участие...//"
        "Тогда вам и вашим родителям лучше найти кого-нибудь еще, чтобы он занимался вашим положением в Хогвартсе и готовил вас к конкурсу.//"
        "Возможно, вам будет проще раздеться перед профессором Снейпом?")
    $daphne("~37 w0 1 def")
    $hero("Или Миневрой Макгонагол? Может, мне поговорить с ней?")
    $daphne("~64 w0 1 def// О, сэр, только не профессор Макгонагол. Все знают, что она не любит девочек!")
    $hero("Ну и кто остается, Снейп?")
    $daphne("~64 01 1 pou// Нет, сэр. Не надо профессора Снейпа. Я буду заниматься с вами.")
    $hero("Тогда вот что, мисс. Если мы с вами избавились от рукавов, значит на следующее занятие вы приходите уже без рукавов. И больше никогда их не одеваете.// Вам нужно привыкнуть оголя... быть не очень стесненной одеждой.")
    $daphne("~64 00 1 ope// Но, сэр!")
    $hero("Никаких сэров! Прямо сейчас вам следует одеть топ без рукавов. Чулки можете оставить, в них вы выглядите по-уродски.")
    $daphne("~73 w0 1 neu// По-уродски, сэр? Тогда я их тоже сниму.")
    $hero("Нет уж, дорогая. Вы сами их на себя напялили, так что теперь расплачивайтесь...// Приступайте мисс, я жду.")

    $screens.Show(Dissolve(1), "blkfade") #Completely black screen.
    $daphne.ItemsCustomize(delete={"sleeves"})("~64 01 1 pou").chibi.State(appearance="e").Refresh()
    $screens.Hide(Dissolve(1), "blkfade") #Completely black screen.
    $screens.Show("ctc").Pause().Hide("ctc")

    $hero("Вот. Теперь другое дело...// Мисс! У вас странно мечтательный вид,... Вы меня слышите?")

    return event.Finalize()
#    $event.Finalize("daphne_approaching") # возвращается в глвное меню